{"Monday, 15 May 2023;  21:28:47": "If This Logger Works. Then, I Am Going To Make It Aesthetically More Pleasing And Clear My Mind / Everthing Being A Burden On My Heart In Here", "Monday, 15 May 2023;  21:35:03": "It Works Though I Shall Make It More Visually Pleasing Somehow", "Monday, 15 May 2023;  21:58:49": "Putted A Bunch Of Vibrant Colors From Ultrons Color Scheme And It Looks Magnificient / Indeed As I Am Tony Stark", "Monday, 15 May 2023;  22:03:27": "Also, Made It Display Recent Logs First.", "Monday, 15 May 2023;  22:05:15": "Its Great | So Lets Make It Clear That I Made This Logger And Got Its Idea From The Social Network As I Loved The Idea That Mark Was Able To Express Himself Simultaneously And Record His Thoughts Though He Was Blogging And I Am Logging But I Am To Record My Thoughts And In The Future, This Will All Be Uploaded Online.", "Monday, 15 May 2023;  22:05:38": "Well, I Got This Idea Last Week", "Monday, 15 May 2023;  22:06:47": "So, Begginning Now, I Want To Confess That I Haven'T Prepared For My Exam And That I Have Been Faking From Last Week Of Being Undiminishable But The Truth Is I Have Not Been Stable.", "Monday, 15 May 2023;  22:07:24": "Like I Was Up The Whole Last Night Crying About You Know My Father", "Monday, 15 May 2023;  22:08:03": "And The Fight Between My Parents Last Week Has Caused Me To Have That (Sort Of Addiction) Problem Greater.", "Monday, 15 May 2023;  22:08:35": "I Have No Hope Of Getting First Position And Am Even Doubting If I Would Even Come In Top 5", "Monday, 15 May 2023;  22:09:46": "I Just Want Exams To Be Over So I Can You Know Become A Much Better Programmer / Engineer", "Monday, 15 May 2023;  22:10:46": "The Main Reason For Such Disasters For Me Mentally Was That Fight Between The Parents Over Sufiyan And Since, Then, I Cannot Help But Think About Much Worse Possibilities", "Monday, 15 May 2023;  22:11:51": "You Know If The Situation Can Come To The Point That They Would Have A Divorce Which Was Only Stopped By Saima Phuppo And Wasim Chachu, Then, I Can Imagine Worse.", "Monday, 15 May 2023;  22:12:14": "I Have Seen Worse Actually In My Dreams Having Nightmares", "Monday, 15 May 2023;  22:12:57": "Discovered A Bug If Logs Amount Bigger Than Some Character Than It Is Going To Overflow", "Monday, 15 May 2023;  22:13:05": " Now, Going To Fix It", "Monday, 15 May 2023;  22:58:28": "At Sir Ahsan'S House, Fixed The Issue Of Overlapping", "Monday, 15 May 2023;  23:22:45": "Chatgpt Failed At First Getting Answer For Rafay'S Novel Query But Corrected Itself So I Am A Prompt Engineer.", "Tuesday, 16 May 2023;  07:27:26": "Woke Up Today Early", "Tuesday, 16 May 2023;  07:28:25": "At Around, 4 30, Shutted Off Alarm, Went Back To Sleep And Was Woken Up By Mom On 6 20, Slept Again And Woke Finally On 6 30.", "Tuesday, 16 May 2023;  07:29:19": "Since Then, Learnt Whole Of The Poetry Section Not Even Seeing The Literature Section But You Know My Past Self And Now My Future Self Who Is A Genius Without Studying.", "Tuesday, 16 May 2023;  07:30:00": "So, Going To Get Ready And Head To School And Learnt The Rest There.", "Tuesday, 16 May 2023;  07:30:37": "Also That I Am Going To Probably Not Get My Copies Checked And If I Do, I Will On Thursday.", "Tuesday, 16 May 2023;  07:31:21": "Also, I Am Different Now, Who Does Not Give A F", "Tuesday, 16 May 2023;  07:32:57": "I Had A Dream In Which There Were Saima Phuppo Present At House With Sufiyan (Deceiving Again, Was Going To Knock Him Out But Did Not) And In The End, When She Was Leaving, Got To Know While Everyone(Laiba And Hamza) Was With Zubair Phuppa, Fatima Was Not And At Home.", "Tuesday, 16 May 2023;  07:33:09": "Thats It", "Tuesday, 16 May 2023;  22:26:13": "Not Any Log Since The Morning, Would Like To Quote That", "Tuesday, 16 May 2023;  22:27:24": "I Am Back To Being My Old Self Now || The Man Arrogant Enough That He Does Not Study For Exam And Still Knows Everything And Gets It All Done Half The Time"}