{"Pakistani News": ["Jemima Goldsmith wishes Tyrian White on her birthday ", "‘Dar critic has no room in PML-N’: Asif advises Miftah to express reservation at party forum", "Islamabad police register FIR of ex-principal secretary to PM Azam Khan ‘going missing’", "Shehbaz asks Nawaz to return to Pakistan, become PM for fourth time", "Asad Rehman Gilani assumes additional charge as Nadra chief", "Senate approves bill allowing ECP to announce election dates", "Electoral rolls to be frozen after July 13, announces ECP", "Karachi exams to resume as cyclone Biparjoy's threat over", "Safety measures: What to do when cyclone Biparjoy hits your city?", "Pakistan scraps COVID restrictions for air travellers ", "Cyclone Biparjoy slowed down, won't make landfall before nightfall in Pakistan: minister", "Cannot pick between US, China: Pakistan", "Cyclone Biparjoy approaching India, Pakistan: What you need to know", "Ex-ISI chief Gen Faiz Hamid 'not under arrest'", "Sindh VCs rally against defence minister's 'dacoits' remarks", "YouTuber Adil Raja held in UK for terrorism charges ", "", "FIA arrests ‘suspect’ involved in Greece migrant boat tragedy", "12 killed, 24 injured in Islamabad-Lahore motorway accident", "SAPM Malik directs Islamabad IGP to double efforts to curb crime", "Bilawal sets allocation of funds for flood victims precondition for budget", "Pakistan has no problem with US developing partnership with India: minister", "Shehryar Afridi distances himself from Sanaullah’s 2019 arrest, shifts responsibility on ANF", "50 AJK youth 'missing' in Greece boat tragedy: official", "Shah Mehmood Qureshi vows to stand with PTI amid exodus", "Cyclone Biparjoy dumps tonnes of trash on Pakistan beaches", "12 Pakistanis identified among survivors of Greek boat tragedy, confirms FO", "Pakistan fishermen allowed to resume activities as cyclone Biparjoy further weakens", "Not undermining anyone, but constrained to tell truth, says Miftah in response to PM's criticism", "Fawad Chaudhry to be indicted in threatening ECP case on June 24", "Karachi weather update: How hot can it get today?", "Pakistani officer honoured with prestigious US anti-trafficking award", "No key role for PTI chief in national politics anymore: Rana Sanaullah", "Punjab to include Japanese language in higher education curriculum", "SC laws to enable petitioners to fully convince court: AGP", "NAB summons PTI chief again in Toshakhana case", "Amendment to Election Act: Attempt to pave way for Nawaz’s participation in elections?", "Cyclone Biparjoy likely to further weaken into ‘depression’ today", "Parents protest against 'illegal' increase in private schools' fee", "Latif Khosa remains safe after gun attack at residence", "Emergency lifted from Pakistan’s coastal areas as cyclone Biparjoy fizzles out", "Journalists should be allowed to do their work, US tells Pakistan", "Pakistan 'safe' from Biparjoy's destruction as cyclone weakens after hitting India", "CAIE gives options to Pakistani students whose exams were cancelled", "Punjab University issues 'degree' to former PM Nawaz Sharif ", "UK court rejects claim Nasir Butt bribed judge to help Nawaz Sharif", "‘Adil Raja arrested by UK counter-terrorism police for overseas offences’", "Karachi mayoral poll result subject to outcome of JI plea: SHC", "Biparjoy makes landfall along India-Pakistan sea border", "PML-N, PPP ‘lock horns over administrative matters in Punjab’", "In a first, British govt appoints female high commissioner to Pakistan", "BIEK postpones intermediate exams scheduled on Friday ", "Pakistani students win most EU scholarships globally", "US scholar sees no major outcome of PTI’s lobbying in Washington", "PPP, JI workers clash after Wahab becomes Karachi mayor, defeating Rehman ", "Pakistan's religious body gives nod to women performing Hajj without mehram", "Karachi mayoral polls: Administrators and history", "Biparjoy: Emaar Pakistan strong, high enough to withstand cyclone's impact, says DHA official ", "Cyclone Biparjoy: Authorities on high alert as Pakistan, India brace for landfall today", "Left to die by Greece coastguards, Pakistan survivors say boat was deliberately sunk", "Verdict reserved on petitions challenging SC judgments review law", "Pakistan observes national day of mourning over Greek boat tragedy", "FIA offloaded 19,000 Pakistanis suspected of illegal immigration in 2022", "PDM coalition is 'practically dead': Shah Mahmood Qureshi", "Najam Saqib audio leaks: IHC gives AGP 4 weeks to answer questions", "Sindh CM directs authorities to expedite work at Malir Expressway", "PM Shehbaz moves to address PPP’s concerns on budget", "Scenic tourist spots in KP get international recognition", "When is Eid ul Adha in Pakistan? Ruet-e-Hilal Committee to sight Zil Hajj moon today", "Pakistani migrant's final call home foretold Greek shipwreck", "Greece boat disaster: Pakistan to observe day of mourning today", "Greece boat tragedy: Key 'human trafficker' arrested in Sheikhupura", "TTP commander among three terrorists killed in Dara Adam Khel IBO", "Federal budget approved with Sindh CM’s consent, says Iqbal in response to PPP's criticism", "Poliovirus detected in KP’s environmental samples", "Inflated electricity bills: Incensed protesters surround IESCO office as demonstrations enter 4th day", "‘I stand by my stance,’ Qureshi says after court extends his remand in cipher case", "Toshakhana case: IHC resumes hearing on Imran Khan's plea", "PPP joins protesters against exorbitant electricity bills", "Imaan Mazari, Ali Wazir granted post-arrest bail in sedition case", "Inflated electricity bills: What can be done to provide immediate relief?", "Amid PTI’s smear campaign against IHC CJ, parties warned against attacking institutions", "India appoints first-ever female chargé d’affaires in Pakistan", "Dozens arrested in Karachi after PTI stages rally in solidarity with Imran Khan", "PM Kakar seeks relief plan within 48 hours for inflated electricity bills", "Exhibition displaying products by Down’s syndrome artist Najla Haroon wins hearts", "Nawaz Sharif has no plan to return to Pakistan soon: Khursheed Shah", "Pakistan police set to arrest Sara Sharif's father by tracking his phone ", "‘Not PTI leaders but some other people partook in May 9 riots’, Imran Khan tells JIT"], "international": [" Germany snatch a draw against Ukraine in 1000th international ... - Reuters.com: \n Germany snatch a draw against Ukraine in 1000th international ...  Reuters.com", " Ukraine's Zelenskiy: Work has started on international investigation ... - Reuters.com: \n Ukraine's Zelenskiy: Work has started on international investigation ...  Reuters.com", " Aubameyang wants Gabon return a year after international retirement - Reuters.com: \n Aubameyang wants Gabon return a year after international retirement  Reuters.com", " Mexico midfielder Guardado retires from international football - Reuters: \n Mexico midfielder Guardado retires from international football  Reuters", " Wales back row Tipuric announces surprise international retirement - Reuters: \n Wales back row Tipuric announces surprise international retirement  Reuters", " Commonwealth Bank of Australia removes international money ... - Reuters.com: \n Commonwealth Bank of Australia removes international money ...  Reuters.com", " Biden nominates former Florida governor Crist to international ... - Reuters: \n Biden nominates former Florida governor Crist to international ...  Reuters", " Brookfield to buy Network International for $2.76 bln - Reuters: \n Brookfield to buy Network International for $2.76 bln  Reuters", " Kirby’s motion-based Tilt ‘n’ Tumble Game Boy game comes to Switch Online: \n June’s additions to Switch Online are Kirby Tilt ‘n’ Tumble, Harvest Moon, Blaster Master: Enemy Below, and the first international release for Mystery Tower.", " Watch Live: Axiom Space's Private Crew Splashes Down to Earth From the ISS: \n A SpaceX Dragon spacecraft carrying four private astronauts is making its way down from the International Space Station (ISS) and is set to splash down in Florida on Tuesday night. The ocean touchdown will be broadcast live. Read more...", " Blackstone acquires International Gemological Institute - Reuters: \n Blackstone acquires International Gemological Institute  Reuters", " Argentina v Australia: international football friendly – live: \n <ul><li>Updates from the Socceroos’ one-off match in China</li><li>Kick-off time in Beijing is 8pm/10pm AEST/1pm BST</li><li>Any thoughts? Get in touch with Rob on email</li></ul>There are four changes from the World Cup match against Argentina. Nathaniel Atk…", " International Boxing Association to appeal stripping of IOC ... - Reuters.com: \n International Boxing Association to appeal stripping of IOC ...  Reuters.com", " Timber! Japan's Wooden Satellite Is Nearly Ready for Space: \n Apparently, space wood is a thing. Japanese researchers are preparing to launch the world’s first satellite made from wood following a successful experiment on board the International Space Station (ISS), which suggests lumber can be quite sturdy in outer spa…", " Boeing Calls Off Its First Crewed Starliner Flight Due to Major Safety Issues: \n Just when you thought the saga of Boeing’s Starliner program couldn’t get any worse, it just did. The first crewed test flight of Boeing’s CST-100 Starliner has been delayed indefinitely due to two serious issues with the crew vehicle meant to transport NASA …", " White House Knew of Ukrainian Plot to Blow Up Nord Stream Pipeline Months in Advance: Report: \n Three months before the Nord Stream pipeline exploded in what was almost certainly a brazen act of international sabotage, the Biden administration was briefed on a plot by the Ukrainian military to target the energy project for destruction, according to a ne…", " International Booker winner Georgi Gospodinov: ‘My dystopian novel became real’: \n The Bulgarian writer opens up about the political fears that informed his prize-winner Time Shelter, about ‘a Pandora’s box of weaponised nostalgia’The idea for a novel involving a clinic of the past, where people with dementia are healed by immersion in the …", " ECB's Centeno: international market price falls yet to reach consumers - Reuters: \n ECB's Centeno: international market price falls yet to reach consumers  Reuters", " Israel's First International Bank Q1 profit jumps, to pay dividend - Reuters: \n Israel's First International Bank Q1 profit jumps, to pay dividend  Reuters", " G7 calls for adoption of international technical standards for AI - Reuters: \n G7 calls for adoption of international technical standards for AI  Reuters", " G7 leaders to discuss idea of international peace summit over ... - Reuters: \n G7 leaders to discuss idea of international peace summit over ...  Reuters", " Britain plugs nursing gaps with international staff amid WHO concern - Reuters: \n Britain plugs nursing gaps with international staff amid WHO concern  Reuters", " Sherritt International reports second fatality at Cuba mine in a month - Reuters: \n Sherritt International reports second fatality at Cuba mine in a month  Reuters", " How to beat airline price gouging when booking international flights: \n If your home airport is small or medium-sized, the airlines will likely charge you much more to fly abroad. This workaround can save hundreds off your fare.", " Happy International Museum Day!: \n Today is International Museum Day! To celebrate, the President of the International Council of Museums (ICOM), Emma Nardi, shared her message, which began:  \n\n\n\n\nAs President of the International Council of Museums (ICOM), I am delighted to address you on the…", " International stand-offs and the WSL 2022-23 best bits - Women’s Football Weekly: \n Faye Carruthers, Suzanne Wrack, Ceylon Andi Hickman and Marva Kreel round up the latest news and dish out their end of season awardsOn today’s pod: are you suffering from football withdrawal? Fear not, ee’ll catch you up on all the latest from the past week i…", " The UK's stance on international students? We need you, but we don't want you | Nesrine Malik: \n On every measure they are, in the government’s eyes, the ideal migrant. Suella Braverman just made their lives more miserableGiven how much the subject of immigration dominates British political life, it is remarkable how little people know about what it actu…", " Wales’s Alun Wyn Jones retires from international rugby with record 170 caps: \n <ul><li>Flanker Justin Tipuric also retiring in further blow to Wales</li><li>Both players had been in preliminary 54-man World Cup squad</li></ul>Alun Wyn Jones, the former Wales and British & Irish Lions captain and the world’s most capped player of all tim…", " Edinburgh international children’s festival review – the playful inner child v the serious grownup: \n Various venues, EdinburghFor children wondering what their parents do all day, many of the delightful shows programmed here will show them that they’re not really so grown upHow curious to be a child trying to make sense of adult behaviour, with its rules, ro…", " Bluey’s cricket episode: why did it leave Australians in tears and Americans puzzled?: \n The latest episode hits cricket fans with a wave of back yard nostalgia. But will kids (and international viewers) understand it?Nick, cricketers everywhere are losing their collective minds over a Bluey episode. What is going on?It’s the third season of Blue…", " AI Draws Attention at G-7 Summit, With Leaders Calling for Guidelines - CNET: \n The leaders of the Group of Seven nations say we need to develop an international framework \"to achieve the common vision and goal of trustworthy AI.\"", " Slovakia on brink of blocking legal recognition for trans people: \n International human rights champions and LGBTQ+ campaigners appeal to MPs to vote against bill proposed by rightwingersSlovakian MPs are under mounting international pressure to reject a bill that would see the country follow Hungary in effectively putting a …", " New US Navy video clearly shows Chinese warship cutting off a US destroyer during 'unsafe' encounter in the Taiwan Strait: \n China called the US presence in international waters a 'provocation.' The incident follows another in the air.", " Mohamed El-Erian says the debt-cap deadlock threatens Americans' economic well-being and the US's international reputation: \n The top economist said the debt-ceiling impasse risks undermining the nation's international reputation for sound economic management.", " Invasion of Ukraine ‘has fuelled funding boom for clean energy’: \n International Energy Agency says investment will hit $1.7tn this year, well ahead of fossil fuelsRussia’s invasion of Ukraine has helped ignite a boom in clean energy investment which will significantly outpace spending on fossil fuels, according to the Inter…", " The dollar's dominance faces several non-economic threats amid a more fragmented global system, says Mohamed El-Erian: \n \"National security and geopolitics are supplanting economics in shaping national and international interactions,\" Mohamed El-Erian wrote.", " Russian Wagner Group is using American social media platforms like Facebook and Twitter to recruit new members around the world, according to new report: \n The paramilitary group is hunting for new international recruits by boasting cushy salaries and benefits, Politico reported.", " Memorial Day travel could make Thursday LAX's busiest day for 3 years as the airport opens an additional waiting lot for pickups: \n Los Angeles International Airport said it expects 218,000 passengers – the most since March 2020 – to turn up on Thursday.", " Watch Axiom Space’s second private flight to the ISS with us at 5PM ET: \n In less than two hours, private space firm Axiom Space is set to launch its second all-civilian flight. At approximately 5:37PM ET, a SpaceX Falcon 9 rocket will attempt to carry the four-person crew, including former NASA astronaut Peggy Whitson, to the Inte…", " Get These Life-Saving Certifications Online for Free: \n You too, can be one of those people who confidently springs into action when there is a person in need: Save a Life and the National Health Care Provider Solutions (NHCPS) created a non-profit organization to certify people around the world with five differen…", " 30 international peacekeepers are injured in fierce clashes with Serbs in Kosovo: \n A statement said that 11 Italian soldiers and 19 Hungarian ones \"sustained multiple injuries, including fractures and burns from improvised explosive incendiary devices.\"", " International trade is slowing rapidly as the COVID recovery fizzles and globalization stalls, Fitch says: \n Fitch Ratings predicted global trade will expand 1.9% this year, down sharply from 2022's growth rate of 5.5%.", " Stunning photos of the night sky in one of the darkest places on Earth will make you want to visit New Zealand ASAP: \n The Aoraki Mackenzie International Dark Sky Reserve is the second-largest in the world. Located in New Zealand, it's an astrophotographer's paradise.", " I thought my husband was 'over-insured,' but his travel insurance will get us $700 after the airline lost our luggage: \n International travel with kids is never stress-free, but when my husband's luggage was lost on our trip to the Bahamas, travel insurance helped a lot.", " Dollar dominance could give way to a new regime that includes the euro, yuan, CBDCs, and maybe something 'we have yet to see': \n \"Within the next decade or two, there is great potential for regionally-dominant currencies and a multipolar international regime to emerge.\"", " A former CEO shares 5 tips on how to grow as a leader without burning out: \n \"When you're stressed out, there's a mismatch between what you want to be doing and what you're actually doing,\" says Sanjay Khosla, former president of Kraft Foods International.", " Russia is shifting to a total war economy as its progress in Ukraine stalls: \n Russia's economy is being shaped more and more by its \"special military operation\" in Ukraine, according to one international relations expert.", " Pegasus Spyware Is Detected in a War Zone for the First Time: \n Researchers say Armenian government workers, journalists, and at least one United Nations official were targeted by the NSO tool.", " Edinburgh book festival hoping Greta Thunberg will bring back audiences: \n Fallout from Covid crisis has left event struggling financially after last year’s ‘traumatic’ fall in salesThe Edinburgh International book festival hopes a swathe of Booker prize winners, political leaders and a guest appearance by Greta Thunberg will help r…", " Peak in global oil demand ‘in sight before end of decade’: \n International Energy Agency says demand will grow by 2.4m barrels per day in 2023 to record 102.3m bpd<ul><li>Shell drops target to cut oil production</li></ul>The worldwide peak in demand for oil is “in sight” and could come before the end of this decade, th…", " Young Australian women struggling to afford period products as inflation soars, survey shows: \n Plan International says stigma around menstruation at heart of problem as it calls for free products in public bathrooms<ul><li>Get our morning and afternoon news emails, free app or daily news podcast</li></ul>Almost two-thirds of young women are struggling …", " Tell us: will you be affected by new limits on overseas students bringing family to the UK?: \n Suella Braverman has announced new limits for international students to bring dependents with them when studying in the UKSuella Braverman has announced new limits for international students to bring family with them to the UK, under proposals released on Tue…", " Iran executes 3 protesters despite international outcry: \n Iran said it executed three men Friday morning on charges of \"waging war against God\" and collaboration with terrorist groups.", " Timelapse captures Mexican volcano spewing smoke into starry sky: \n Timelapse footage shows the Popocatepetl volcano in the state of Puebla erupting.", " Saudi astronauts, including nation's 1st woman, catch a SpaceX flight to space station: \n Saudi Arabia's first astronauts in decades rocketed toward the International Space Station on a chartered multimillion-dollar flight. The crew will spend just over a week there before returning home.", " SpaceX mission returns from space station with ex-NASA astronaut, 3 paying customers: \n The return caps a nine-day mission to the International Space Station. The mission was funded by Axiom Space, a company that wants to build and operate the world's first commercial space station.", " Here's how rodent research on the International Space Station is going: \n The Rodent Research 5 mission, a collaboration between NASA and SpaceX (Elon Mouse-k?), is the subject of a new study published in Cell Reports explaining some of the medical insights these moustranauts have made possible concerning bone density, deterioratio…", " How riding rockets going 4,000 mph into suborbital space could slash international flight times from 22 hours to 2: \n Companies like SpaceX, Blue Origin, and Rocket Lab are exploring the possibility of using rockets to transport cargo across the globe in record time.", " Germany set to make it easier for international tech talent to get work visas: \n A great work-life balance, excellent transport, a chosen spot of major tech companies, and a social culture featuring currywurst and Oktoberfest… welcome to Germany, a country that’s trying to make itself a top choice for workers keen to move abroad. Germany …", " New standards in diagnosing concussions proposed by UBC prof - Vancouver Is Awesome: \n <ol><li>New standards in diagnosing concussions proposed by UBC prof  Vancouver Is Awesome\r\n</li><li>International group of experts redefines concussions  UBC News\r\n</li><li>View Full Coverage on Google News</li></ol>", " White House reveals its next steps towards 'responsible' AI development: \n The White House has made responsible AI development a focus of this administration in recent months, releasing a Blueprint AI Bill of Rights, developing a risk management framework, committing $140 million to found seven new National Academies dedicated to AI…", " At least 32 dead as migrant boat capsizes off Greece: \n At least 32 people have drowned after their fishing vessel capsized off the coast of southern Greece.", " WATCH: Bear captured after wandering onto Tampa International Airport property: \n The juvenile bear was relocated to Ocala National Forest.", " Russia-Ukraine war live: first Kherson dam flooding deaths; UN nuclear watchdog to strengthen presence at Zaporizhzhia plant: \n Three confirmed dead, says exiled mayor in Kherson region; International Atomic Energy Agency to send larger team in response to ‘possible loss of the plant’s main source of cooling water’<ul><li>Russia-Ukraine war at a glance</li></ul> Continue reading...", " Binance reaches deal with SEC to avoid US asset freeze: \n The Securities and Exchange Commission and Binance have come to an agreement that will allow the cryptocurrency exchange to continue operating in the US until a lawsuit filed by the SEC earlier this month is resolved. The regulator sued Binance and founder Ch…", " United Airlines employees accused of years-long scheme selling weed stolen out of customers' checked baggage: \n United Airlines baggage handlers at San Francisco International Airport ran a drug scheme that goes back at least 3 years, prosecutors alleged.", " Meet the international firefighters battling Canada's worst wildfire season in a century - CBC.ca: \n <ol><li>Meet the international firefighters battling Canada's worst wildfire season in a century  CBC.ca\r\n</li><li>Firefighters from South Africa break into song and dance as they arrive in Alberta to help  Global News\r\n</li><li>Massachusetts firefighters hea…", " What happened in the Russia-Ukraine war this week? Catch up with the must-read news and analysis: \n UK to build ‘international coalition’ for F-16 fighter jets; life in Mariupol a year since Russian occupationEvery week we wrap up the must-reads from our coverage of the Ukraine war, from news and features to analysis, visual guides and opinion. Continue rea…", " Transgender women banned from women's chess events: \n The ruling by the International Chess Federation is drawing criticism from some players.", " Kuwait Petroleum International Ltd - Reuters: \n Kuwait Petroleum International Ltd  Reuters", " Voyager Space and Airbus to Collaborate on Commercial Successor to the ISS: \n Colorado-based company Voyager Space is collaborating with Europe’s Airbus to build a commercial space station in low Earth orbit that will succeed the International Space Station (ISS) following its retirement. Read more...", " Singapore Airlines flags near-term competition in international travel - Flipboard: \n Singapore Airlines flags near-term competition in international travel  Flipboard", " Israel's First International Bank names new CEO - Reuters.com: \n Israel's First International Bank names new CEO  Reuters.com", " England's Hales announces international retirement at 34 - Reuters: \n England's Hales announces international retirement at 34  Reuters", " Airbnb forecasts upbeat revenue as international travel rebounds - Reuters: \n Airbnb forecasts upbeat revenue as international travel rebounds  Reuters"], "elon musk": [" Ron DeSantis Pushed Elon Musk's Twitter to Its Breaking Point: \n Launching his White House bid on the social network revealed the technical and political limitations of Musk's platform.", " Ford needs Tesla to help it beat Tesla: \n Tesla and Ford are the number one and two EV sellers, respectively, but now Ford is adopting Tesla’s NACS charging port. Both Ford CEO Jim Farley and Elon Musk see that as the future charging standard for the US.", " Twitter’s biggest ad buyer no longer considers it ‘high risk,’ says report: \n WPP-owned GroupM no longer considers Twitter as a “high risk” platform now that seasoned advertising exec Linda Yaccarinoc is lined up to replace Elon Musk as Twitter CEO", " Twitter’s head of brand safety and ad quality has left the company: \n Twitter lost its executive in charge of content moderation on the platform, Ella Irwin, earlier this week. In another sign of instability in Twitter's upper ranks, it looks like yet another top executive is leaving the company. The Wall Street Journal reports…", " Twitter's head of safety and content moderation has left the company: \n Twitter has lost another head of trust and safety after Elon Musk purchased the company last year. According to Reuters, Ella Irwin, the website's top executive for content moderation has resigned. Fortune has also reported earlier that her company Slack acco…", " Twitter reportedly accuses Microsoft of violating its data use policy: \n Elon Musk's personal lawyer, Alex Spiro, has reportedly sent Microsoft a letter that accuses it of using Twitter API \"for unauthorized uses and purposes.\" According to The New York Times and The Wall Street Journal, Spiro wrote that \"Microsoft may have been i…", " Walter Isaacson's Long-Awaited Biography of Elon Musk Is Finally Ready: \n Renowned journalist and author Walter Isaacson announced in a Twitter post on Thursday that his new Elon Musk biography is on the horizon. Isaacson has chronicled the lives of geniuses like Steve Jobs, Jennifer Doudna, Leonardo da Vinci, Benjamin Franklin, an…", " San Francisco is reportedly investigating Twitter over possible building code violations: \n San Francisco authorities have opened a new investigation into Twitter after six former senior employees filed a lawsuit against the company, according to AP and the San Francisco Chronicle. The plaintiffs are accusing the company of breaking local and federa…", " 7 Times Elon Musk Said ‘Do as I Say, Not as I Do’ About Remote Work: \n Twitter CEO Elon Musk slammed people who work from home in an interview this week and declared the practice was “morally wrong,” despite the fact that, as head of three companies, it is virtually impossible for him to be in three offices at once. He’s the qui…", " Spoutible's Low-Budget, Audacious Quest to Be the Next Twitter: \n When Elon Musk’s reign of toxic chaos began, Christopher Bouzy didn’t just go looking for a rival place to post. He joined the crowded race to create one. (It got difficult.)", " Twitter CEO Linda Yaccarino Is Teetering on the Glass Cliff: \n Elon Musk’s appointment repeats a pattern in which companies led into crisis by men suddenly appoint women leaders.", " Twitter has reportedly refused to pay its Google Cloud contract: \n More platform instability could be in Twitter’s near future. In 2018, Twitter signed a $1 billion contract with Google to host some of its services on the company’s Google Cloud servers. Platformer\r\n reports\r\n Twitter recently refused to pay the search giant …", " Elon Musk’s lawyer accuses Microsoft of abusing its access to Twitter data: \n Elon Musk’s personal lawyer Alex Spiro sent a letter on behalf of Twitter to Microsoft CEO Satya Nadella accusing Microsoft of violating an agreement between them for the use of its APIs and data.", " Elon Musk expects Neuralink to do its first implantation in humans ... - Reuters.com: \n Elon Musk expects Neuralink to do its first implantation in humans ...  Reuters.com", " Elon Musk visits China's commerce ministry - Reuters.com: \n Elon Musk visits China's commerce ministry  Reuters.com", " Mongolian PM discusses EV investment, cooperation with Elon Musk - Reuters: \n Mongolian PM discusses EV investment, cooperation with Elon Musk  Reuters", " Music publishers are suing Twitter for $250 million over 'massive' copyright infringement: \n Twitter has yet another major lawsuit to contend with. A group of more than a dozen music publishers has filed\r\n a $250 million lawsuit against the company over allegations of “massive” copyright infringement on the platform.The suit, filed by the National Mu…", " Jack Dorsey Endorses RFK Jr. for President: \n Over the weekend, Twitter co-founder and CEO of Block Jack Dorsey officially put his outsized weight behind a leading anti-vaxxer for president. Dorsey can now join other tech execs like his strained friend Elon Musk endorsing extremist political candidates, …", " Judge throws out shareholder lawsuit against Elon Musk over ... - Reuters: \n Judge throws out shareholder lawsuit against Elon Musk over ...  Reuters", " GM EV owners will gain access to Tesla Superchargers in 2024: \n Ford isn't the only electric automaker switching to Tesla's North American Charging Standard — General Motors says it's making the change, too. CEO Mary Barra announced the move during a Twitter Spaces chat with Tesla CEO Elon Musk on Thursday, stating that i…", " China foreign minister meets with Elon Musk in Beijing - Reuters: \n China foreign minister meets with Elon Musk in Beijing  Reuters", " Elon Musk reverses course and says Tesla will advertise its cars - Reuters.com: \n Elon Musk reverses course and says Tesla will advertise its cars  Reuters.com", " Elon Musk scheduled to visit Tesla's Shanghai plant on Weds night ... - Reuters.com: \n Elon Musk scheduled to visit Tesla's Shanghai plant on Weds night ...  Reuters.com", " Elon Musk says he learned China will initiate AI regulations - Reuters.com: \n Elon Musk says he learned China will initiate AI regulations  Reuters.com", " Ron vs. Don: Why DeSantis may be able to defeat the Trump juggernaut - CBC News: \n <ol><li>Ron vs. Don: Why DeSantis may be able to defeat the Trump juggernaut  CBC News\r\n</li><li>Ron DeSantis Launches His Presidential Bid With Elon Musk On Twitter Spaces | USA Elections News  CNN-News18\r\n</li><li>Elon Musk fumbles digital town square debut…", " Welp, the FDA Says Elon's Brain Interface Company Can Start Carving Up Humans: \n Neuralink, Elon Musk’s Brian computer interface company, said late Thursday that it had received long-awaited FDA approval to begin brain tests in human subjects. Soon, the company will conduct invasive brain surgery on humans to determine whether its mind-re…", " Neuralink: Why is Elon Musk’s brain chip firm in the news?: \n Elon Musk’s brain chip firm Neuralink has received the US regulatory green light for its first human clinical trial, after earlier controversies.", " Elon Musk reclaims title of world’s richest person: \n Maverick head of Tesla and Twitter overtakes French billionaire Bernard Arnault, head of the LVMH luxury goods empireElon Musk is once again the world’s richest person after leapfrogging French billionaire Bernard Arnault, after a slump in the value of Arnaul…", " Elon Musk has ruled out a 'winter' for artificial intelligence, and hints the AI boom is just beginning: \n \"There will not be a winter for AI, quite the opposite,\" Elon Musk tweeted on Sunday.", " Twitter is being kicked out of its Colorado office after not paying rent for months, report says: \n Elon Musk said Twitter would only pay rent \"over his dead body,\" according to one lawsuit. Now one landlord is getting help from the sheriff to evict.", " Elon Musk's decision to not pay rent on Twitter's offices is adding to commercial mortgage headaches at Goldman Sachs: \n Twitter has still not paid rent on its office spaces, and Elon Musk told an advisor he would pay rent \"over his dead body,\" according to a lawsuit.", " Elon Musk is nicknamed 'Karen Musk' in a Reddit thread that slams him for calling remote working immoral: \n Elon Musk's anti-remote work comments have been criticized by some Redditors as being privileged and entitled.", " Elon Musk mocks Apple's Vision Pro by taking a swipe at its price tag: \n The $3,499 price tag for Apple's Vision Pro mixed-reality headset may even be a stretch for the world's richest man, Elon Musk.", " Investors are pouring money into Tesla because it's becoming an AI bet in addition to its status as the top EV name: \n Elon Musk has hinted Tesla could soon jump onto the AI bandwagon, as language models like ChatGPT kick up a storm on Wall Street.", " Twitter's new CEO just sent her first email to employees, then posted it on Twitter: \n New Twitter CEO Linda Yaccarino shared her outlook for \"Twitter 2.0\" as she takes over from owner Elon Musk after his tumultuous reign at the platform.", " Elon Musk, who wants to put chips in people's brains, says the Unabomber — who died last week — 'might not be wrong' that tech is bad for humanity: \n Elon Musk, the CEO of brain-implant company Neuralink, shared a meme on Ted Kaczynski's death and suggested his extreme Luddite beliefs weren't wrong.", " Elon Musk sat down with Italy's prime minister for a wide-ranging discussion that veered from AI risks to birth rates: \n Elon Musk is also visiting Paris on Friday, where he will speak at the Viva Tech conference and is expected to meet the French prime minister.", " AI presents 'risk of extinction' on par with nuclear war, industry leaders say: \n With the rise of ChatGPT, Bard and other large language models (LLMs), we've been hearing warnings from the people involved like Elon Musk about the risks posed by artificial intelligence (AI). Now, a group of high-profile industry leaders has issued a one-se…", " Jack Dorsey says Elon Musk became 'reckless' and 'impatient' and rushed out new Twitter features that 'weren't thought out': \n Twitter cofounder Jack Dorsey reflected on Elon Musk's run as CEO in a new interview, calling some of the billionaires's moves \"fairly reckless.\"", " Elon Musk warns house price declines will accelerate as higher interest rates squeeze buyers: \n \"This will accelerate, as high interest rates make homes less affordable,\" Elon Musk said of home prices in a tweet.", " Here's an idea for Twitter, Elon: Copycat your way to a $630 billion empire just as Mark Zuckerberg did: \n The Meta chief is reportedly rolling out a Twitter clone for Instagram in the coming months. Elon Musk should copy from Zuckerberg to grow Twitter.", " Elon Musk pulled Twitter from the EU's anti-disinformation agreement and continues to troll with alt-right memes and dogwhistles. It could be a sign he'll close the site to Europe completely.: \n Twitter's withdrawal from an agreement on disinformation could signal Elon Musk is preparing to cease operations in Europe entirely, a report says.", " Companies are using Twitter's own tools to keep their ads away from Elon Musk's tweets: \n Twitter has \"adjacency controls\" promoted by Elon Musk that help companies keep ads clear of certain content or users.", " The Trump-DeSantis showdown is now official, and artificial intelligence is right in the middle of it: \n In a video posted by Trump, DeSantis and Elon Musk are joined on Twitter Spaces by Adolf Hitler, the FBI, Dick Cheney, George Soros, and Klaus Schwab.", " Elon Musk is no longer the CEO of Twitter: \n Linda Yaccarino said Monday she had her first day at Twitter, two weeks before she was expected to take over from Elon Musk.", " Elon Musk is wrong about a housing-market crash: \n Musk said home values are set to plummet. But most experts believe that there aren't even enough homes for sale to send prices down.", " The Morning After: Industry leaders say AI presents 'risk of extinction' on par with nuclear war: \n With the rise of AI language models and tools like ChatGPT and Bard, we've heard warnings from people involved, like Elon Musk, about the risks posed by AI. Now, a group of high-profile industry leaders has issued a one-sentence statement: “Mitigating the ris…", " Mark Cuban says Elon Musk's AI company could create a 'virtual Elon' and calls it 'pretty scary': \n Mark Cuban says Elon Musk's Twitter purchase could help his AI venture compete with OpenAI and other companies.", " Elon Musk was asked what he'd tell his kids about choosing a career in the era of AI. His answer revealed he sometimes struggles with self-doubt and motivation.: \n When asked about the future of AI and work, Elon Musk says he has to have a \"deliberate suspension of disbelief in order to remain motivated.\"", " Elon Musk says he largely manages his own schedule and only uses a part-time assistant to manage his workload: \n Speaking at the WSJ CEO Council Summit, Elon Musk called time management extremely difficult and said time was the most valuable thing he had.", " Twitter is only worth a third of what Elon Musk paid for it, major asset manager says: \n Twitter is continuing to plummet in value under Elon Musk's leadership, according to financial services corporation, Fidelity.", " Elon Musk told Chinese Tesla workers in a late night speech that their hard work 'warms my heart' — 6 weeks after some complained about bonus cuts: \n Elon Musk previously praised Tesla's 20,000 staff at the Shanghai Gigafactory for \"burning the 3 a.m. oil.\" Around 100 attended his speech Wednesday.", " Elon Musk disclosed a missed opportunity, said he hates firing people, and revealed a desire to meet Warren Buffett in a 2008 profile that's resurfaced: \n Elon Musk told the San Francisco Business Times about his passion for building cars and rockets, and bemoaned not buying into SunPower.", " Elon Musk says remote work is 'morally wrong' and people need to 'get off the goddamn moral high horse with the work from home bullshit': \n Elon Musk said the \"laptop classes are living in la la land,\" and it's not fair that they can work from home when restaurant and auto workers can't.", " 6 photos of Elon Musk's visit to China, from a 16-course dinner to meetings with Chinese officials: \n China is home to Tesla's largest production hub. Elon Musk has said the growing tension between the US and China \"should be a concern for everyone.\"", " One name notably left out of DeSantis's 2024 campaign launch on Twitter Spaces? Trump.: \n During a live forum on Twitter Spaces with Elon Musk and David Sacks, Ron DeSantis only made the slightest dig at Donald Trump.", " 10 Things in Tech: Amazon’s guide to AI in different industries, Earth’s neighboring star, and workers look for less stressful jobs: \n In today's edition: HR is torn on job applicants using AI, Elon Musk gets government approval for putting brain chips in humans, and more headlines.", " Bill Maher says he 'loved' talking to Elon Musk but he 'doesn't get' his beliefs on making more babies and colonizing Mars: \n Elon Musk plans to send 1 million people to Mars, and Starlink requires customers recognize that Mars is a free planet ungoverned by Earth's laws.", " Elon Musk says Twitter video app for smart TVs is 'coming' - Reuters: \n Elon Musk says Twitter video app for smart TVs is 'coming'  Reuters", " Tesla is offering 3 years of free supercharging and big discounts to sell more cars by June 30: \n Elon Musk has cut Tesla prices several times this year as he looks to cement the EV maker's market-leading position and boost sales.", " Elon Musk is about to pull Twitter out of a major online disinformation agreement in Europe, report says: \n Elon Musk will next week sign off on the plan to withdraw from the disinformation code that Meta, Google, and TikTok all agree with, per Politico.", " Elon Musk says it's not impossible for AI to control humanity — to save it from itself: \n Speaking at the WSJ CEO Council Summit, Elon Musk reiterated his concerns about advanced AI development and the potential risks it posed.", " Elon Musk keeps getting creepier: \n Elon Musk this week threatened to show up at Mark Zuckerberg’s house and challenge him to a fight, live streaming all the way. It’s the latest concerning behavior from the man above SpaceX, Tesla, and more.", " Elon Musk is killing ‘Environmental Twitter’: \n Twitter used to be a crucial gathering place for environmental advocates and researchers. But many users went inactive after Elon Musk’s takeover of the social media platform now called X.", " Elon Musk’s ‘fund your legal bill’ tweet is a brand new level of bullshit: \n Where was Elon Musk’s unlimited legal defense fund for employees “unfairly treated” when Elon Musk fired six employees for him on Twitter?", " X is slowing down links to websites Elon Musk has publicly feuded with: \n It appears that Elon Musk is, once again, punishing websites run by his perceived enemies. The website formerly known as Twitter seems to be interfering with links to The New York Times, Mastodon, Bluesky, Threads and Substack to make them load noticeably slo…"], "technology": [" Marvell Technology beats quarterly revenue estimates - Reuters: \n Marvell Technology beats quarterly revenue estimates  Reuters", " China Telecom establishes quantum technology group - Reuters: \n China Telecom establishes quantum technology group  Reuters", " Good News! China and the US Are Talking About AI Dangers: \n Scientists from the world’s two superpowers are concerned about the risks of AI—which may offer a bridge to developing global regulations.", " Scientists Successfully Transmit Space-Based Solar Power to Earth for the First Time: \n The California Institute of Technology has big news for space-based power. Researchers at the university have reportedly beamed solar power from space to Earth without a single wire—and they say it’s a first.Read more...", " Politicians Need to Learn How AI Works—Fast\\: \n Tech regulation has often disappointed. Automation expert Missy Cummings hopes a course to teach policymakers about artificial intelligence can help.", " mRNA technology for vaccines and more: An Ars Frontiers recap: \n The tech has lots of applications beyond the one we've already been injected with.", " Talitrix Prison-Monitoring System Tracks Inmates Down to Their Heart Rate: \n Documents WIRED obtained detail new prison-monitoring technology that keeps tabs on inmates' location, heartbeats, and more.", " ChatGPT Is Unoriginal—and Exactly What Humans Need: \n The technology can help cut through buzzwordy “solutions” and serve as a shortcut for jumpstarting creativity.", " Snapchat’s AR filter can now paint your nails: \n Snapchat’s partnership with OPI features a new nail segmentation technology, allowing users to virtually try on nail colors and designs.", " How Humanity Can Avoid an AI Takeover: \n We talk to MIT professor Daron Acemoglu about his book Power and Progress and unpack why making direct human-to-AI comparisons isn't necessarily helpful in determining our relationship with technology.", " Chinese startup says its new EV battery doesn’t lose range in the cold: \n The Chinese startup Greater Bay Technology claims its latest EV battery can charge at normal speeds even in cold temperatures. Huang Xiangdong, co-founder and chairman, says the company’s new Phoenix cell uses superconducting materials and thermal management …", " Nvidia, MediaTek Partner on Connected Car Technology: \n Nvidia and MediaTek on Monday said they will collaborate on technology to power advanced vehicle infotainment systems that can stream video or games or interact with drivers using artificial intelligence. From a report: Under the agreement, announced at the C…", " Toyota claims its future EVs will have a range over 600 miles: \n The distance EVs can go on a single charge has steadily increased over the years, with top options from the likes of Mercedes, BMW and Tesla all touting an estimated range of over 350 miles. Now, Toyota, a long-time hybrid maker (who can forget when having a …", " Meta’s open-source speech AI recognizes over 4,000 spoken languages: \n Meta has created an AI language model that (in a refreshing change of pace) isn’t a ChatGPT clone. The company’s Massively Multilingual Speech (MMS) project can recognize over 4,000 spoken languages and produce speech (text-to-speech) in over 1,100. Like most…", " Welp, the FDA Says Elon's Brain Interface Company Can Start Carving Up Humans: \n Neuralink, Elon Musk’s Brian computer interface company, said late Thursday that it had received long-awaited FDA approval to begin brain tests in human subjects. Soon, the company will conduct invasive brain surgery on humans to determine whether its mind-re…", " Trump's Media Company Wants $3.8 Billion in Lawsuit Against Washington Post: \n Trump Media & Technology Group Corp. (TMTG) filed a $3.8 billion defamation lawsuit against The Washington Post last week, claiming the news outlet made false and defamatory statements against the company. The lawsuit claims The Post knowingly published “fals…", " Toyota Unveils Groundbreaking EV Battery Technology: \n A recent technical briefing was conducted by Toyota, during which the company highlighted its objectives to develop superior electric vehicle (EV) battery technology, boost aerodynamics, and modernize production processes. Toyota is continuing to focus on a h…", " Former Samsung executive accused of trying to copy an entire chip plant in China: \n South Korean President Yoon Suk Yeol recently declared the chip manufacturing industry to be in an \"all-out war,\" and the latest developments certainly support that statement. Prosecutors in the Suwon District have indicted a former Samsung executive for alle…", " NVIDIA's Neuralangelo is an AI model that can generate 3D objects from 2D videos: \n NVIDIA has introduced a new AI model called Neuralangelo that can create 3D replicas of objects from 2D videos, whether they're classic sculptures or run-of-the-mill trucks and buildings. Neuralangelo works by selecting several frames showing the subject from…", " Apple Releases Safari Technology Preview 172 With Bug Fixes and Performance Improvements: \n Apple today released a new update for Safari Technology Preview, the experimental browser Apple first introduced in March 2016. Apple designed the ‌Safari Technology Preview‌ to test features that may be introduced into future release versions of Safari.\n\n\n\n\n…", " Apple reveals Vision Pro, a AR/VR headset unlike any other: \n \"I believe augmented reality is a profound technology,\" says Tim Cook.", " Don't Want Students to Rely on ChatGPT? Have Them Use It: \n It’s easy to forget how little students and educators understand generative AI’s flaws. Once they actually try it out, they’ll see that it can’t replace them.", " Apple Releases Safari Technology Preview 170 With Bug Fixes and Performance Improvements: \n Apple today released a new update for Safari Technology Preview, the experimental browser Apple first introduced in March 2016. Apple designed the ‌Safari Technology Preview‌ to test features that may be introduced into future release versions of Safari.\n\n\n\n\n…", " Sonos wins $32.5 million patent infringement victory over Google: \n Google has been ordered to pay Sonos $32.5 million for allegedly infringing on the company’s smart speaker patent.", " Shell to use new AI technology in deep sea oil exploration - Reuters: \n Shell to use new AI technology in deep sea oil exploration  Reuters", " AI poses national security threat, warns terror watchdog: \n Security services fear the new technology could be used to groom vulnerable peopleThe creators of artificial intelligence need to abandon their “tech utopian” mindset, according to the terror watchdog, amid fears that the new technology could be used to groom…", " India’s Tech Obsession May Leave Millions of Workers Without Pay: \n The Modi government is forcing low-paid workers to use a glitchy new digital registration system that fails in places with weak internet.", " LAYER Takes a Quiet Approach to Technology for Samsung: \n Soften the din of technology in your life with this organic and quietly conceived battery pack design by LAYER and founder Benjamin Hubert for Samsung.", " Beijing bans Chinese companies from using Micron chips in critical infrastructure: \n China’s cybersecurity regulator has banned Chinese firms from buying chips from US memory manufacturer Micron Technology. Per Reuters\r\n, the Cyberspace Administration of China (CAC) said Sunday it found that the company’s products pose “significant security r…", " Emergence of Smart Elevators and Escalators with IoT Technology: \n Summary : Like everything else, the new generation elevators and escalators are becoming smarter and more well-connected. Let’s see how IoT lifts up the traditional elevator system, making it faster, safer, and more personalized.  Rapid urbanization and the r…", " Smart Parking: UWB Technology Solving Parking Woes of Urban Population: \n In urban areas, parking can be a major headache for residents and visitors alike. With limited parking space and high demand, finding a spot can take time and effort. Moreover, UWB technology gains traction in smart parking due to advantages over traditional …", " How can Technology help in Reducing Road Accidents?: \n The Current Scenario No country can exist without transportation via roads. The development and growth of all nations are invariably connected with their roads. Despite the intrinsic nature of these improved surfaces for the purposes of conveyance of traffic,…", " AR Technology: A New Approach to Attract Blood Donors: \n In recent years, attracting young blood donors has become a significant challenge for blood centers across the United States. With the ongoing pandemic, the situation has worsened, and the need for innovative solutions is more urgent than ever. Blood centers …", " How Expense Management Technology Is Transforming the Finance Industry: \n Employee expenses and expense management are key aspects of financial operations that go beyond simply tracking reimbursement claims and employee-submitted receipts. Businesses are increasingly finding benefits in finance automation solutions with robust expe…", " The Surgeon General Is Pushing for a Misguided Social Media Policy: \n Recommendations from the new report on youth mental health won’t protect kids—but they’ll destroy the privacy of everyone who uses the internet.", " Runaway AI Is an Extinction Risk, Experts Warn: \n A new statement from industry leaders cautions that artificial intelligence poses a threat to humanity on par with nuclear war or a pandemic.", " AI Could Face New Rules in the EU to Address Risks to You - CNET: \n Preliminary legislation aims to protect humans from potential risks associated with AI technology.", " Squint raises funding to expand its AR-powered technology platform: \n According to Squint, its next-gen AR (augmented reality) technology enables organizations to seamlessly digitize factory SOPs.", " Police to use facial recognition technology in Cardiff during Beyoncé concert: \n Police will deploy technology in city centre to identify wanted individuals, leading to warning use of invasive surveillance becoming normalisedPolice will use live facial recognition technology in Cardiff during the Beyoncé concert on Wednesday, despite conc…", " Apple’s Vision Pro VR is incredible technology but is it useful?: \n The new product is far ahead of its competition; however, it is not clear that there is a pressing need for it or that most people can afford itAs people begin to report on their hands-on time with Apple’s Vision Pro VR headset, it’s becoming increasingly cle…", " Petrol and diesel engines are dying technology. The electric car age is inevitable | Ben Lane: \n Arguments over the green credentials of electric cars are already over. Work on 21st-century tech, and leave the past behind<ul><li>Ben Lane is co-founder and CTO at Zapmap, a UK-wide map of electric car charging points</li></ul>It should by now be clear to a…", " ChatGPT and Generative AI: Our Guide to 2023's Most Talked-About Technology: \n ChatGPT brought generative AI into the limelight when it hit 1 million users in five days. But how valid is the buzz around ChatGPT?", " Risk of extinction by AI should be ‘global priority’, say tech experts: \n Hundreds of tech leaders call for world to treat AI as danger on par with pandemics and nuclear warA group of leading technology experts from across the globe have warned that artificial intelligence technology should be considered a societal risk and priorit…", " ChatGPT and Generative AI in Payments: Reality, Hype, What's Next, and How to Prepare: \n ChatGPT is the most talked-about technology of 2023 and has caught the attention of payments services providers.", " Cross-border payroll is complicated — and risky. From tax and labor laws to forex and banking regs, here's what you need to know.: \n Explore the methods and technology solutions to help your company streamline its global payroll process.", " 1Password launches its public passkey beta: \n From today, 1Password users can now create, store, and share passkeys for supported websites by installing the 1Password beta browser extension.", " A moonshot for infrastructure: \n ARPA-I is an advanced research and development agency for infrastructure run out of the US Department of Transportation. It needs funding.", " Heinz Remix is the sauce dispenser of our dreams: \n Never mind crafting custom sodas at the restaurant — technology will soon help you customize your dips, too. Kraft Heinz has unveiled a Heinz Remix dispenser that lets you customize sauces through a touchscreen interface. You choose from base sauces and then …", " Apple's AirTag 4-pack is just $80 right now: \n If you've been debating whether to pick up some Apple AirTags, now might be the time finally to go for it. The AirTag 4-pack currently has a 20 percent discount, dropping from $100 to $80. Not only does this bring the pack close to its all-time-lowest price, …", " Solo Stove has up to 45 percent off site-wide for Memorial Day: \n Solo Stove is offering up to 45 percent off its popular low-smoke fire pits. Additionally, you’ll get a free Mesa tabletop unit — a $120 value — by purchasing any fire pit or bundle when you use the code FREEMESA at checkout. The deals last from today until J…", " EU and Google collaborate on 'AI pact' ahead of new guidelines: \n The EU and Google have begun collaborating to create an AI pact ahead of guidelines in the works to control AI technology.", " Google and the European Commission will collaborate on AI ground rules: \n The world’s governments have taken note of generative AI’s potential for massive disruption and are acting accordingly. European Commission (EC) industry chief Thierry Breton said Wednesday that it would work with Alphabet on a voluntary pact to establish art…", " NASA's SLS rocket is $6 billion over budget and six years behind schedule: \n NASA's Space Launch System (SLS) rocket designed to take astronauts to the moon is over budget and far behind it's original schedule, according to a scathing new audit from NASA's Inspector General. Furthermore, the report foresees \"additional cost and schedu…", " TV tonight: Stormzy and Harry Kane are warring neighbours in deepfake series: \n See celebrities in a new light thanks to AI technology. Plus: warming Norwegian comedy-drama Afterglow concludes. Here’s what to watch this evening Continue reading...", " Google Flooded the Internet With AI News. Where's Apple? - CNET: \n Apple hasn't publicly entered the generative AI race yet. But there's a good chance we'll see the technology baked into its upcoming software.", " Carbon capture and storage is ‘no free lunch’, warns climate chief: \n IPPC chair Hoesung Lee says over-reliance on the technology could mean the world misses 1.5C targetOver-reliance on carbon capture and storage technology could lead the world to surpass climate tipping points, the head of the world’s climate science authority…", " ChatGPT and Generative AI in Insurance: Reality, Hype, What's Next, and How to Prepare: \n ChatGPT is the most talked-about technology of 2023 and has piqued the interest of insurance industry leaders.", " ChatGPT and Generative AI in Insurance: Reality, Hype, What's Next, and How to Prepare: \n ChatGPT is the most talked-about technology of 2023 and has piqued the interest of insurance industry leaders.", " Humans Aren’t Mentally Ready for an AI-Saturated ‘Post-Truth World’: \n The AI era promises a flood of disinformation, deepfakes, and hallucinated “facts.” Psychologists are only beginning to grapple with the implications.", " Google Lens Now Lets You Search for a Skin Condition. Here's How - CNET: \n Worried about a rash or mole? You can find visual matches online and gather more information with Google's image-recognition technology.", " EU regulator orders Google to sell part of ad-tech business: \n Competition commission accuses firm of favouring its own services to detriment of rivalsThe EU has ordered Google to sell part of its advertising business, as the bloc’s competition regulator steps up its enforcement of big tech’s monopolies.The competition c…", " See the 12 coolest features of the Lucid Air, a swanky new Tesla rival with a huge frunk and over 1,000 horsepower: \n The electric luxury sedan justifies its $180,000 price point with a fancy interior, tons of technology, and heart-pumping speed.", " More Battlefield AI Will Make the Fog of War More Deadly: \n The Pentagon’s embrace of military AI raises questions about what limits should be placed on the technology—and how to keep humans in control.", " The $219 WiiM Pro Plus is a modern audio streamer for your existing hi-fi: \n Linkplay Technology has launched the WiiM Pro Plus, a successor to the company’s well-liked WiiM Pro audio streamer that’s designed to easily modernize your existing audio equipment.", " A Letter Prompted Talk of AI Doomsday. Many Who Signed Weren't Actually AI Doomers: \n In March a viral letter called for a pause on AI development, warning that algorithms could outsmart humanity—but many experts who signed on did not believe the technology poses an existential risk.", " Why charge an EV when you can just swap its battery?: \n EV battery swapping could help solve the problem of inadequate charging infrastructure, but the technology relies on specialized battery packs that seem beyond what US automakers are willing to consider."], "programming": [" Google launches Live tab for Android TV with international programming: \n Google launches Live TV channels for Android TV owners including international channels.", " 'Mojo May Be the Biggest Programming Language Advance In Decades': \n Mojo is a new programming language developed by Modular1 that aims to address the performance and deployment limitations of Python in areas like AI model development. After demoing Mojo prior to its launch, Jeremy Howard from the non-profit research group fas…", " Deepmind’s AI Is Learning About the Art of Coding: \n AlphaDev has made small but significant improvements to decades-old C++ algorithms. Its builders say that’s just the start.", " Meta sells Giphy to Shutterstock at a loss following UK order: \n The UK ordered Meta to sell Giphy at the end of 2021, and now the social media heavyweight is following through. Stock photo provider Shutterstock has reached a deal to buy Giphy from Meta for $53 million. Notably, this won't break compatibility — Meta is ent…", " Amazon is reportedly planning an ad-supported tier for Prime Video: \n Amazon is reportedly planning to introduce an ad-supported tier to its Prime Video platform. The Wall Street Journal\r\n reports that discussions are in the early stages and have been going on for the past several weeks.The report goes on to say that advertiser…", " Willow Is One of Many Shows About to Depart Disney+ and Hulu: \n Axes continue to fall at Disney this week—and now the company is getting to shows with actual axes in them. Last week, Disney revealed in an earnings call that it would begin to remove programming from some of its streaming services as a cost-cutting measure,…", " Disney Gets Big Write-Off After Pulling Its Streaming Shows: \n Last week, Disney removed a little over 100 of its original programming from its streaming services such as Disney+ and Hulu around the world. That cut media, which includes the likes of Willow and Marvel’s Runaways, were axed after Disney gave a heads up abo…", " Why YouTube is a tough place for kids podcasts: \n Children’s podcast publisher Tinkercast is struggling to grow its audience on YouTube. Also, more British radio IP is coming to Spotify and Apple.", " Souped-Up Reflective Sensor Uses Itself for Wireless Programming: \n Proximity sensors are common enough in automation projects that we hardly give them a second thought — pick something with specs that match the job and move on. But they can be fussy to get a…", " NYT: It's the End of Computer Programming As We Know It: \n Long-time Slashdot theodp writes: Writing for the masses in It's the End of Computer Programming as We Know It. (And I Feel Fine.), NY Times opinion columnist Farhad Manjoo explains that while A.I. might not spell the end of programming (\"the world will still…", " CS50, the World's Most Popular Online Programming Class, Turns to AI for Help: \n \"The world's most popular online learning course, Harvard University's CS50, is getting a ChatGPT-era makeover,\" reports Bloomberg:\n\nCS50, an introductory course in computer science attended by hundreds of students on-campus and over 40,000 online, plans to u…", " Aspect-Oriented Programming: \n Comments", " Functional Python Programming: \n Author, A. M. Kuchling,, Release, 0.32,. In this document, we’ll take a tour of Python’s features suitable for implementing programs in a functional style. After an introduction to the concepts of ...", " Apple Expands Its On-Device Nudity Detection to Combat CSAM: \n Instead of scanning iCloud for illegal content, Apple's tech will locally flag inappropriate images for kids. And adults are getting an opt-in nudes filter, too.", " Spotify cuts 200 roles from its podcast division: \n Music streaming giant Spotify is axing around 200 roles from its global podcasting division, 2 percent of its overall workforce, as part of a “strategic realignment” of the vertical.", " Apple restricts employees from using ChatGPT over fear of data leaks: \n Apple says employees shouldn’t use generative AI tools including OpenAI’s AI chatbot ChatGPT. ChatGPT stores users conversations by default, leading companies to worry about data leaks.", " Apple wants to turn your iPhone into a pet-tracking camera: \n Apple is releasing a new developer tool called DockKit that could pave the way for apps that control motorized phone mounts based on the movement of your pet.", " Sigils are an underappreciated programming technology: \n Sigils have a bit of a bad reputation. According to their detractors, sigils are “just a way of encoding type information” in variable names – basically a glorified version of apps Hungarian notati…", " Programming Culture in the Late Aughts: \n How it felt to be computing in the late aughts vs. now.", " DreamBerd is a perfect programming language: \n perfect programming language. Contribute to TodePond/DreamBerd development by creating an account on GitHub.", " Here’s How To Build a Tiny Compiler From Scratch: \n Believe it or not, building a tiny compiler from scratch can be as fun as it is accessible. [James Smith] demonstrates by making a tiny compiler for an extremely simple programming language, and sh…", " Contrary View: Chatbots Don’t Help Programmers: \n [Bertrand Meyer] is a decided contrarian in his views on AI and programming. In a recent Communications of the ACM blog post, he reveals that — unlike many others — he thinks AI in its …", " Recreating an Analog TV Test Pattern: \n While most countries have switched to digital broadcasting, and most broadcasts themselves have programming on 24/7 now, it’s hard to remember the ancient times of analog broadcasts that would eventually …read more", " 23 New Free Channels Are Coming to Freevee This Year: \n Standing up to the likes of Netflix, Hulu, and the now-maligned Max comes Amazon’s Freevee. After the viral success of Jury Duty earlier this year, the little streaming service that could is bolstering its roster of channels with 23 new offerings.Read more...", " AI Threatens Humanity's Future, 61% of Americans Say: \n The swift growth of artificial intelligence technology could put the future of humanity at risk, according to most Americans surveyed in a Reuters/Ipsos poll published on Wednesday. From the report: More than two-thirds of Americans are concerned about the ne…", " Stack Overflow Didn’t Ask How Bad Its Gender Problem Is This Year: \n The coding hub’s 2022 survey found that 92 percent of its users were men. This time around it simply dropped the question.", " Programming with Natural Language Is Going to Work (2010): \n Articles by Stephen Wolfram covering artificial intelligence, computational science and computational thinking, data science, education, future and historical perspectives, sciences, software design, technology, Wolfram products, more.", " Logic programming is overrated, at least for logic puzzles (2013): \n Logic programming is experiencing something of a resurgence in the Clojure community, sparked by core.logic, a port of miniKanren, an embed...", " Building a Programming Language in Twenty-Four Hours: \n I know I promised to put out an article every week on a Sunday. I haven't been too good at sticking to that schedule. It's now Sunday morning at around 8:50...", " Unison Language and Platform Roadmap: \n A friendly programming language from the future.", " Google Colab Promises 'AI-Powered Coding, Free of Charge': \n Google Colab hosts free cloud-based \"executable documents\" that, among other things, let you write and run code in your browser (in dozens of languages, including Python). \n\nOver 7 million people, including students, already use Colab, according to a recent p…", " Where have all the hackers gone?: \n A way to talk about programming languages, and a plea to Think Different™", " Swift Ownership Manifesto: \n The Swift Programming Language. Contribute to apple/swift development by creating an account on GitHub.", " 10 Common Programming Myths Debunked: \n Plenty of misconceptions surround the world of programming, so it’s wise to be aware of what has merit and what is merely rumour.", " I Am No Longer Speaking at RustConf 2023: \n I will no longer be speaking at RustConf 2023 about A (Possible) Future for Compile-Time Programming.", " Tucker Carlson ‘will not be silenced’ as Fox News seeks to ban Twitter show: \n Fox News has reportedly sent a cease and desist letter to its former host but his lawyer says show will go onTucker Carlson’s lawyer says he “will not be silenced by anyone” after it was reported that Fox News had sent the prime-time host it fired a letter de…", " ACM Sigplan ICFP will be in Seattle, WA, USA on 4–9 September 2023: \n The 28th ACM SIGPLAN International Conference on Functional Programming will be in Seattle, WA, USA on 4–9 September 2023.", " AI can make anyone a programmer and has 'closed the digital divide,' Nvidia CEO says: \n \"Everyone is a programmer now — you just have to say something to the computer,\" the chipmaker's CEO said at a conference on Monday.", " Ask HN: Is there a good camping chair that is comfortable for programming?: \n Comments", " The Morning After: Let’s talk about Air Quality: \n Wildfires in Canada have led to a surge in air pollution levels in the US, with New York currently having the worst air quality of any major city. There are plenty of images of N95-mask-wearing people walking down smog-blighted streets that wouldn’t look out …", " Jane Street Tech Blog – Oxidizing OCaml: Locality: \n Coming from OCaml, the Rust programming language has many appealingfeatures.  Rust’s system for tracking lifetime and ownership allowsusers to safely express...", " How Much Memory Do You Need to Run 1M Concurrent Tasks?: \n In this blog post, I delve into the comparison of memory consumption between asynchronous and multi-threaded programming across popular languages like Rust, ...", " What Are Shaders?: \n In this article you will learn on the basic level what shaders are and how they are used in graphics programming.", " Function Back Deployment: \n This maintains proposals for changes and user-visible enhancements to the Swift Programming Language. - swift-evolution/0376-function-back-deployment.md at main · apple/swift-evolution", " IntelligentPad (1989) a component-based drag-and-drop software creator: \n IntelligentPad was a drag-and-drop software creator based on the concept of reusable components. Pads could be reused on other pads. There was no programming...", " Functional Programming in Lean – a book on using Lean 4 to write programs: \n Comments", " Ask HN: Those with success using GPT-4 for programming – what are you doing?: \n Comments", " Retool (YC W17) is hiring hackers to combine visual programming with AI: \n Comments", " These 21 Subreddits Are Going Dark to Protest Reddit's API Changes: \n Reddit is in for a rude awakening, just ask some of its most popular subreddits. To protest Reddit’s recent plan to charge for access to its API, some of the platform’s biggest communities will be going dark for at least two days.Read more...", " Who is Amy Entelis? CNN exec who lead award-winning documentary unit will take over from Chris Licht: \n Entelis revitalized the network's original series, with shows like Anthony Bourdain's \"Parts Unknown\" and \"Stanley Tucci: Searching for Italy.\"", " Fox News Demands Tucker Carlson Shut Down Unhinged Twitter Show: \n Former Fox News host Tucker Carlson’s new show, Tucker on Twitter, might not be on Twitter for much longer. On Monday, Carslon’s ex-employer upped the pressure on its former host and sent the right-wing commentator a “cease and desist” letter, according to Ax…", " Nuances of Overloading and Overriding in Java: \n I’ve been programming in Java for over half a decade, and thought I knew how overloading and overriding worked. It was only once I started thinking of and writing up the following corner case…", " ‘I like to slag off the headliner’: what is it like to do standup at a music festival?: \n Sophie Duker and Jacob Hawley discuss how to draw revellers away from pop stars while Glastonbury’s Charlotte Lang explains what it takes to win over the cabaret tentYou’re in a massive tent. People are walking in and out, chatting, spilling drinks. A mishmas…", " How Bravo's 'Vanderpump Rules' and #Scandoval have boosted NBCUniversal's Peacock as streamers increasingly lean into reality TV: \n NBCU's Peacock capitalized on the recent runaway success of \"Vanderpump Rules,\" showing the streaming potential of reality TV, according to new data.", " CNN's Chris Licht is out after a year of crisis — these 14 top execs are charged with carrying the network forward while Warner Bros. Discovery searches for its new CEO: \n Having lost the confidence of his staff and his Warner Bros. Discovery bosses, CNN CEO Chris Licht is out. Here's who'll lead while WBD searches for his replacement.", " A few wise words have stopped me eating like a barnyard animal | Adrian Chiles: \n After decades of just shovelling in food, I have finally learned to pace myselfI read and listen to an awful lot of words. How many? Let’s see. I must get through at least four hours of speech radio, podcasts and audiobooks a day. At roughly three words a sec…", " The Y2K bug should teach us to be wary of AI | Letters: \n John Thow on the global effort that prevented a Y2K disaster, and Robert Frazer on Isaac Asimov’s laws of roboticsRe the existential threat from AI (Letters, 2 June), Phyl Hyde says the concerns over Y2K were “a panic” about an “overblown future cause”. Like …", " Software Driving Hardware: \n We were talking about [Christopher Barnatt]’s very insightful analysis of what the future holds for the Raspberry Pi single board computers on the Podcast. On the one hand, they’re becoming …read more", " Power series, power serious: Talk by Doug McIlroy (2007) [video]: \n I will sing praises for the power of “lazy” languages, notably Haskell, to express operations on infinite data structures, and will use power-series algorithms as a prime example. In this style of programming, subscripts magically evaporate; generating functi…", " The Many Faces of Distinct in PostgreSQL: \n I started my programming career as an Oracle DBA. It took a few years but eventually I got fed up with the corporate world and I went about doing my own thing. After I gotten over not having proper partitions and MERGE statement, I found some nice unique feat…", " Python Recursion: A Trampoline from the Mutual Head to the Memoized Nested Tail: \n Recursion is a key concept of programming. However, it is usually only superficially explored. There are different ways of having recursion, this post will illustrate them using Python examples, call graphs and step-by-step runs. Including cases of head, tail…", " The Industrial Hammer Complex: \n I’ve been programming for 35 years and getting paid to do it for almost 20. I’m happy to say that I still love it just as much as when I typed those first programs into my C64 as a kid. However...", " Luwu Dynamics XGO-Mini2 Review: Programmable Robotic Rover: \n Think of it as a budget version of Boston Dynamics’ Spot for beginner hackers. It ain’t cute, but you can teach it new tricks.", " Ham Pairs Nicely with GMRS: \n Ignoring all of the regulations, band allocations, and “best amateur practices,” there’s no real fundamental difference between the frequencies allocated to the Family Radio Service (FRS), the General Mobile Radio …read more", " A trio of trusted execs move to steady CNN after a chaotic year and Licht's exit: \n ", " Bito launches ChatGPT-powered assistant for developers, personalized to their codebase: \n The assistant, dubbed Bito AI, can learn from a user's own codebase — though importantly, it keeps all of this information on a user's device", " What's New on (HBO) Max in June 2023: \n Hype is one thing; bad buzz is another. The word on HBO’s new series The Idol, premiering on HBO and the streaming service formerly known as HBO Max on June 4, has definitely been trending toward the latter. Co-created by Euphoria’s Sam Levinson, the fictiona…", " Star Trek: Strange New Worlds Joins Strike Programming Wave by Airing on CBS: \n Don’t let the gloss fool you, but CBS has announced it’ll be airing Star Trek: Strange New Worlds on the network to celebrate Star Trek Day.Read more...", " Spotify almost removed 'white noise' podcasts to save money: \n White noise podcast creators on Spotify are making serious money, and the audio streaming service was reportedly not happy about it and tried to cut them off. According to Bloomberg, it has viewed an internal document revealing that podcasts with white noise …", " Bram Moolenaar's programming language, Zimbu: \n With the news of Bram Moolenaar's death at age 62, fans around the web shared their memories of a life lived, including a personal project known only to a few: his own programming language.", " A Texas education official went rogue, announcing that right-wing PragerU programming was coming to state classrooms: \n The education official, Julie Pickren, had previously been criticized for singing \"God Bless America\" as protesters stormed the Capitol on Jan. 6."], "engineering": [" Autodesk's EVP says the company's secret sauce during tough economic times is ensuring customers always get value for their dollars: \n Autodesk creates software products for a variety of global industries, such as manufacturing, architecture, engineering, media, and education.", " Apple exec shows off his guitar skills, proves his guitar solo in pre-recorded event was legit: \n Craig Federighi, Apple's vice president of software engineering, was shown shredding guitar in a video clip from the company's WWDC event.", " An Evaluation of Quantum Algorithms On Classical Hardware Using The CuQuantum Framework - SemiEngineering: \n <ol><li>An Evaluation of Quantum Algorithms On Classical Hardware Using The CuQuantum Framework  SemiEngineering\r\n</li><li>How Schrödinger's cat makes better qubits  Phys.org\r\n</li><li>Quantum Computers Are Better at Guessing, New Study Demonstrates - USC Vit…", " Critical Schrödinger Cat Code: Quantum Computing Breakthrough for Better Qubits - SciTechDaily: \n <ol><li>Critical Schrödinger Cat Code: Quantum Computing Breakthrough for Better Qubits  SciTechDaily\r\n</li><li>How Schrödinger's cat makes better qubits  Phys.org\r\n</li><li>Quantum Computers Are Better at Guessing, New Study Demonstrates - USC Viterbi | Scho…", " Your Engineering Pad in Browser: \n It was always easy to spot engineering students in college. They had slide rules on their belts (later, calculators) and wrote everything on engineering pads. These were usually a light brown or gr…", " Reverse Engineering a Better Night’s Sleep: \n All you want is a decent night’s sleep, so you decide to invest in one of those fancy adjustable beds. At first, it’s fine — being able to adjust the mattress to your needs on the…", " Scientists claim they're the first to transmit space-based solar power to Earth: \n The idea of solar energy being transmitted from space is not a new one. In 1968, a NASA engineer named Peter Glaser produced the first concept design for a solar-powered satellite. But only now, 55 years later, does it appear scientists have actually carried …", " Politicians Need to Learn How AI Works—Fast\\: \n Tech regulation has often disappointed. Automation expert Missy Cummings hopes a course to teach policymakers about artificial intelligence can help.", " The Simplest Social Engineering Hack Of Them All: \n Here at Hackaday we cover news and interesting features for the hacker community, with an emphasis more on the hardware side. Nevertheless we also cover stories from time to time from the broader w…", " The Postal Service Is Begging You to Fix Your Mailbox: \n Good news, everybody—it’s Mailbox Improvement Week! While this is sometimes spun as an opportunity to “beautify” your mailbox (paint it, plant some flowers around it), there’s a more pressing issue: a human being has to stick their hand inside that thing, so …", " A top Twitter engineering boss says he quit the day of Ron DeSantis' botched campaign launch: \n Foad Dabiri said that Twitter before and after Elon Musk's $44 billion takeover were \"two distinct eras.\"", " Astronomers propose the potential structure of 'Next Generation Arecibo Telescope' - Interesting Engineering: \n <ol><li>Astronomers propose the potential structure of 'Next Generation Arecibo Telescope'  Interesting Engineering\r\n</li><li>Astronomers Want to Build the Next Generation Arecibo Telescope  Universe Today\r\n</li><li>View Full Coverage on Google News</li></ol>", " The Talk Show Live From WWDC 2023 With Craig Federighi and Others Now Available on YouTube: \n The Talk Show Live From WWDC 2023 is now available to watch on YouTube. Daring Fireball's John Gruber discussed the Vision Pro and other WWDC announcements with Apple's software engineering chief Craig Federighi, hardware engineering chief John Ternus, AR/VR …", " Teenage Engineering TP–7 Offers the Reel Sensation of Tactile Controls: \n Teenage Engineering's master class audio device TP-7 is designed for true, one-hand operation, emphasizing the senses of touch, sound, and sight.", " Language Pragmatics Engineering: \n On best practices and gradient descent.", " Objects in Apple’s Vision Are Closer Than They Appear: \n This week, we learn what it's like to wear and use Apple's Vision Pro headset. Also, we round up the rest of the news from WWDC.", " It Takes an Hour to Load This Dart-Blasting Minigun but 9 Seconds to Empty It: \n Hasbro tends to design its dart-firing Nerf blasters to look like toys, or classic sci-fi props, with performance geared towards keeping kids safe. Grown up dart blaster enthusiasts, by comparison, strive to create absolutely terrifying, over-powered, foam-fl…", " NASA Fears Budget Cuts Are Imminent After Biden Signs New Legislation: \n NASA is anticipating a bit of a cash crunch after deficit reduction legislation went into effect this week, potentially encroaching on the space agency’s budget for the upcoming year.Read more...", " Reverse Engineering Self-Supervised Learning: \n Self-supervised learning (SSL) is a powerful tool in machine learning, but\nunderstanding the learned representations and their underlying mechanisms\nremains a challenge. This paper presents an in-depth empirical analysis of\nSSL-trained representations, encomp…", " Microsoft now sells Surface replacement parts, including displays, batteries, and SSDs: \n Microsoft is making it easier to replace Surface components. Surface owners can now purchase replacement parts direct from the Microsoft Store.", " ‘Game changer.’ Scientists are genetically engineering crops to clone themselves: \n Side-stepping plant sex could dramatically lower the cost of high-yielding, hybrid crops such as rice and sorghum", " Experience: I knew nothing of the pandemic until my submarine surfaced: \n We were suddenly bombarded with information that made no sense to usIn 2019, I started at the École Polytechnique, a prestigious French engineering school where students undergo military training with the air force, army or navy. I was sent to the naval schoo…", " Amazon server outage makes some website go dark: \n The outage is being resolved and affected web services for some fast food apps, airlines and others.", " Hackaday Prize 2023: Building a Relay ALU: \n There’s much truth in the advice that, to truly understand something, you need to build it yourself from the ground up. That’s the idea behind [Christian]’s entry for the Re-engineering …read more", " A Peak Inside a 747 Fuel Gauge: \n It isn’t that often that we civilians get the chance to closely examine the fantastic internals that make up the modern marvels of avionic engineering. Luckily for us, [Glen] got his hands on…", " 'BlackBerry' review: The comedy and tragedy of the innovator's dilemma: \n BlackBerry has everything Apple's \r\nTetris \r\nfilm lacked\r\n: human drama grounded in actual history, without the need to spice things up with car chases and fantastical storytelling. On the face of it, the rise and fall of Research in Motion's keyboard-equippe…", " A trip to Dyson’s dirt-filled, germ-obsessed world: \n Inside Dyson’s Singapore headquarters, where the vacuum company opens up about why it’s so focused on dirt — and tries to convince the world that everyone needs to be cleaner.", " Meet the inventors making Hyrule’s most complicated contraptions: \n The Legend of Zelda: Tears of the Kingdom players are using their big brains to design and build complicated contraptions. They’ve formed the Hyrule Engineering Club.", " People Let a Startup Put a Brain Implant in Their Skulls—for 15 Minutes: \n Precision Neuroscience’s brain-computer interface sits on top of the brain, not in it. That could make it easier to implant, and less likely to damage tissue.", " CBI’s future to be decided in crunch vote today – business live: \n Rolling coverage of the latest economic and financial news<ul><li>CBI’s survival hangs in balance as trade bodies cast fate-defining vote</li></ul>Some CBI members have voiced their support for the group, ahead of today’s vote.About a dozen firms, including e…", " Readers reply: if Shakespeare wrote for the masses, why is his work now an intellectual preserve?: \n The long-running series in which readers answer other readers’ questions on subjects ranging from trivial flights of fancy to profound scientific and philosophical conceptsIf Shakespeare wrote for the masses, why is his work now an intellectual preserve? John…", " Waluigi, Carl Jung, and the Case for Moral AI: \n Nintendo's Luigi has a chaos-causing alter ego. AI's shadow could put humanity at risk—but can be contained.", " Dyson launches 360 Vis Nav and V15s Detect Submarine: \n An updated robot cleaner and an all-new wet-and-dry vac are dandy, but the revolutionary battery tech Dyson keeps dangling is nowhere to be found.", " The Open-World Genius of The Legend of Zelda: Tears of the Kingdom: \n Unlike other blockbuster games, Tears of the Kingdom allows for improvisation, tinkering, and fantastic feats of engineering.", " A $14 million penthouse atop the tilting Millennium Tower is up for sale, again: \n While the opportunity to own a penthouse offering fantastic views of San Francisco and its surrounding bay might sound good, the idea of owning one in the Millennium Tower should give anyone pause. The incredible circus arising from corner and cost-cutting at…", " The house of the future could be built with dirty diapers: \n Using dirty diapers in building materials could cut down on the mountains of diaper waste that build up in landfills, a new paper finds.", " Ask HN: Engineering managers, how do you onboard new hires?: \n Comments", " A Prompt Pattern Catalog to Enhance Prompt Engineering with ChatGPT: \n Prompt engineering is an increasingly important skill set needed to converse\neffectively with large language models (LLMs), such as ChatGPT. Prompts are\ninstructions given to an LLM to enforce rules, automate processes, and ensure\nspecific qualities (and quan…", " World's first X-ray of a single atom in Nature - Tech Explorist: \n <ol><li>World's first X-ray of a single atom in Nature  Tech Explorist\r\n</li><li>World's First X-Ray of a Single Atom Reveals Chemistry on The Smallest Level  ScienceAlert\r\n</li><li>World's First X-Ray Of A Single Atom Achieved  IFLScience\r\n</li><li>This is t…", " Apple CEO Tim Cook says Vision Pro is 'tomorrow's engineering, today': Exclusive: \n Cook also called on tech companies to self-regulate as they develop AI.", " Generative AI: Posing Risk of Criminal Abuse: \n The use of generative artificial intelligence (AI) by hackers has become an emerging threat to cybersecurity. Generative AI allows hackers to generate realistic and convincing fake data, such as images, videos, and text, which they can use for phishing scams,…", " ‘It’s ridiculously antiquated’: could robot boats transform marine science?: \n No one has yet been able to sail an autonomous boat across the Atlantic, but a young couple in Wales hope their craft will revolutionise ocean monitoring of temperatures, wildlife and moreWhen Anahita Laverack and Ciaran Dowds tested their robot boat for the …", " Using Adapt and Beam for Effective Data Modeling: \n Uncover the power of data architecture patterns and tools in Part 3. Discover the future of data modeling and engineering.", " What People Are Getting Wrong This Week: UFOs and the Government: \n This week, a lot of people are wrong about aliens and UFOs.Read more...", " No Tim Cook, the Apple Vision Pro headset does not cost '$34.99': \n Tim Cook was asked on Good Morning America how much the Vision Pro headset costs. He said 'thirty-four, ninety-nine.' Robin Roberts corrected him.", " I wore the Apple Vision Pro. It’s the best headset demo ever.: \n The new Apple Vision Pro is an incredibly impressive VR headset with terrific displays and great video passthrough. But the demos are familiar, and Apple hasn’t found a killer app.", " I'm a former Google engineer who founded an AI startup. Here are the AI tech skills to learn and the tech roles AI will replace.: \n Zach Smith, a former Google engineer and founder of AI startup Nova AI, says AI changed everything about how he works.", " Legendary Mozambican ruby sells for record price: \n The world's largest ruby, described it as a \"once-in-a-lifetime\" jewel, fetches $34.8m at auction.", " Lehman’s Laws of Software Evolution: \n In the world of software engineering, the Lehman's Laws of Software Evolution are widely recognized as a fundamental framework for understan...", " Ducking finally, Apple eliminating its most annoying autocorrection: \n Yes, you can manually turn off the iOS autocorrect feature that annoyingly changes \"fuck\" to \"duck\" but now you won't have to bother. \n\n\n\n\"In those moments where you just want to type a ducking word, well, the keyboard will learn it, too,\" Apple's head of sof…", " Scientists Successfully Transmit Space-Based Solar Power to Earth for the First Time: \n The California Institute of Technology has big news for space-based power. Researchers at the university have reportedly beamed solar power from space to Earth without a single wire—and they say it’s a first.Read more...", " Last Gasp: A Dying NASA Telescope Spotted Three Exoplanets in Its Final Days: \n Five years since the Kepler Space Telescope was retired, a team of astronomers believe they’ve found exoplanets captured by some of the veteran observatory’s last light.Read more...", " NASA selects Blue Origin for Artemis V mission - BroadcastProME.com: \n <ol><li>NASA selects Blue Origin for Artemis V mission  BroadcastProME.com\r\n</li><li>Artemis V is Going to the Moon With Blue Origin  Universe Today\r\n</li><li>Blue Origin bags $3.4 billion NASA contract to land humans on the moon  Interesting Engineering\r\n</l…", " GitHub Survey Finds 92% of Programmers Are Using AI Tools: \n Is using computer code to debug computer code a little too on the nose? Not for programmers at large companies, apparently. A new survey from Microsoft’s GitHub says that out of 500 programmers surveyed, 92% reported using AI tools in their workflow.Read more…", " In-Ear Device Aims to Help People With Long Covid Get Answers About Their Illness: \n STAT Health announced it has created a device that will monitor the root cause for people suffering from long Covid and POTS (postural orthostatic tachycardia syndrome) symptoms. The device, called STAT, uses blood flow measurements to determine why an indivi…", " Teenage Engineering OP-1: How a Micro Synth Made a Massive Impact in Music Tech: \n The unexpected journey of a portable synthesizer that captured the public imagination and launched a powerhouse design studio", " 'He's About to Graduate College and Join SpaceX as an Engineer. He's 14.': \n \"Kairan Quazi will probably need someone to drive him to work at SpaceX,\" writes the Los Angeles Times — because \"He's only 14.\"\n\nThe teen is scheduled to graduate this month from the Santa Clara University School of Engineering before starting a job as a sof…", " Meet Jensen Huang, the 60-year-old cofounder of chipmaker Nvidia, whose wealth has more than doubled this year to nearly $35 billion thanks to the AI boom: \n Nvidia's market valuation closed in on the elusive $1 trillion mark following a stunning 25% after-hours rally on Wednesday.", " Chegg Embraced AI. ChatGPT Ate Its Lunch Anyway: \n The education company is a case study in generative AI’s disruptive power. Now it's trying to prove it can beat back ChatGPT with an in-house chatbot.", " How RxHTML Works: \n I had a great conversation with a friend at lunch about how RxHTML works since I’m pivoting towards a “concierge engineering company”. Today, I want to illustrate how the full stack web app side of Adama works.", " Software Bugs That Cause Real-World Harm: \n Years ago, when I was an undergraduate student at McGill, I took a software engineering class, and as part of that class, I heard the infamous story of the Therac-25 computer-controlled radiotherap…", " 12 Podcasts That Explore the Weirder Corners of the Internet: \n The internet is a place full of dark corners, deep rabbit holes, endless mazes, and wild threads. But with the chaos comes storytelling gold: These 12 podcasts use communities like Reddit, Yelp, Twitter, and Tumblr to launch into a different part of the digit…", " US Air Force denies AI drone attacked operator in test: \n A virtual experiment was described by a senior official at a conference, but he now says he \"mis-spoke\".", " A Fight Over the Right to Repair Cars Takes a Wild Turn: \n A landmark right to repair law in Massachusetts is great for car owners. The US government argues it’s also great for hackers.", " Bitmovin (YC S15) Is Hiring an Engineering Manager for Encoding in Berlin: \n Core skills: Leadership, Coaching, Career Planning, Agile Software Delivery, Hiring, Project Management, Design for scalability, Cloud Native, Microservices,", " Changed Your iPhone's Passcode and Forgot It? iOS 17 Gives You 72 Hours to Reset It: \n If you change your iPhone's passcode and forget it soon after, iOS 17 has a new option available to help out. Specifically, it is now possible to reset an iPhone's new passcode with the previous passcode for up to 72 hours after the change is made.\n\n\n\n\n\nIf yo…", " The Guardian view on England’s water companies: a badly broken system | Editorial: \n Ministers were warned about the risks of private equity entering the sector but did nothing. Now we’re paying the priceThe revelation should anger all who care about England’s rivers and beaches. Two decades ago, ministers were warned about private equity fir…", " CHINA MECHANICAL ENGINEERING - Reuters: \n CHINA MECHANICAL ENGINEERING  Reuters", " Occidental Petroleum to buy Carbon Engineering for $1.1 bln - Reuters: \n Occidental Petroleum to buy Carbon Engineering for $1.1 bln  Reuters", " Messenger's encrypted chats expand to more users ahead of full rollout later this year: \n Meta is considerably expanding Messenger's encryption feature, rolling it out to \"millions more people's chats\" starting today, the company announced. The end-to-end encryption (E2EE) standard, which first arrived a year ago, will be available as standard to …", " Researchers’ app could help people with visual impairments navigate the NYC subway: \n Researchers at NYU’s Tandon School of Engineering and Grossman School of Medicine have created an app to help people with visual impairments navigate New York City’s subway system. Commute Booster uses a smartphone camera to recognize relevant signs along a t…", " China's economy faces a lopsided supply and demand problem that's been years in the making: \n Beijing has spent decades stimulating its economy on the supply side, but engineering consumer confidence and more robust demand has proved difficult."], "software engineering": [" The Talk Show Live From WWDC 2023 With Craig Federighi and Others Now Available on YouTube: \n The Talk Show Live From WWDC 2023 is now available to watch on YouTube. Daring Fireball's John Gruber discussed the Vision Pro and other WWDC announcements with Apple's software engineering chief Craig Federighi, hardware engineering chief John Ternus, AR/VR …", " Reverse Engineering a Better Night’s Sleep: \n All you want is a decent night’s sleep, so you decide to invest in one of those fancy adjustable beds. At first, it’s fine — being able to adjust the mattress to your needs on the…", " Lehman’s Laws of Software Evolution: \n In the world of software engineering, the Lehman's Laws of Software Evolution are widely recognized as a fundamental framework for understan...", " Microsoft now sells Surface replacement parts, including displays, batteries, and SSDs: \n Microsoft is making it easier to replace Surface components. Surface owners can now purchase replacement parts direct from the Microsoft Store.", " Autodesk's EVP says the company's secret sauce during tough economic times is ensuring customers always get value for their dollars: \n Autodesk creates software products for a variety of global industries, such as manufacturing, architecture, engineering, media, and education.", " Apple exec shows off his guitar skills, proves his guitar solo in pre-recorded event was legit: \n Craig Federighi, Apple's vice president of software engineering, was shown shredding guitar in a video clip from the company's WWDC event.", " Your Engineering Pad in Browser: \n It was always easy to spot engineering students in college. They had slide rules on their belts (later, calculators) and wrote everything on engineering pads. These were usually a light brown or gr…", " Objects in Apple’s Vision Are Closer Than They Appear: \n This week, we learn what it's like to wear and use Apple's Vision Pro headset. Also, we round up the rest of the news from WWDC.", " Software Bugs That Cause Real-World Harm: \n Years ago, when I was an undergraduate student at McGill, I took a software engineering class, and as part of that class, I heard the infamous story of the Therac-25 computer-controlled radiotherap…", " People Let a Startup Put a Brain Implant in Their Skulls—for 15 Minutes: \n Precision Neuroscience’s brain-computer interface sits on top of the brain, not in it. That could make it easier to implant, and less likely to damage tissue.", " The Simplest Social Engineering Hack Of Them All: \n Here at Hackaday we cover news and interesting features for the hacker community, with an emphasis more on the hardware side. Nevertheless we also cover stories from time to time from the broader w…", " Apple Discusses 15-Inch MacBook Air's Design in New Interview: \n Apple's VP of hardware engineering Kate Bergeron and marketing employee Laura Metz recently spoke with Tom's Guide's Mark Spoonauer about the design of the new 15-inch MacBook Air, including its larger display and two additional speakers.\n\n\n\n\n\nBergeron said t…", " Meta unveils new AI data centers and supercomputer to power AI-first future: \n Meta announced today a series of new hardware and software projects that aim to support the next generation of AI applications.", " Hacking a Hyundai Ioniq’s Infotainment System Again After Security Fixes: \n These days modern cars are nothing if not a grouping of networked software held together by bits of hardware. This is reflected not only in the rapidly increasing number of ECUs, but also infotainm…", " JPL Creates World's Largest PDF Archive to Aid Malware Research: \n NASA's Jet Propulsion Laboratory (JPL) has created the largest open-source archive of PDFs as part of DARPA's Safe Documents program, with the aim of improving internet security. The corpus consists of approximately 8 million PDFs collected from the internet.…", " Ducking finally, Apple eliminating its most annoying autocorrection: \n Yes, you can manually turn off the iOS autocorrect feature that annoyingly changes \"fuck\" to \"duck\" but now you won't have to bother. \n\n\n\n\"In those moments where you just want to type a ducking word, well, the keyboard will learn it, too,\" Apple's head of sof…", " Language Pragmatics Engineering: \n On best practices and gradient descent.", " A Prompt Pattern Catalog to Enhance Prompt Engineering with ChatGPT: \n Prompt engineering is an increasingly important skill set needed to converse\neffectively with large language models (LLMs), such as ChatGPT. Prompts are\ninstructions given to an LLM to enforce rules, automate processes, and ensure\nspecific qualities (and quan…", " I'm a former Google engineer who founded an AI startup. Here are the AI tech skills to learn and the tech roles AI will replace.: \n Zach Smith, a former Google engineer and founder of AI startup Nova AI, says AI changed everything about how he works.", " GitHub Survey Finds 92% of Programmers Are Using AI Tools: \n Is using computer code to debug computer code a little too on the nose? Not for programmers at large companies, apparently. A new survey from Microsoft’s GitHub says that out of 500 programmers surveyed, 92% reported using AI tools in their workflow.Read more…", " The CEO of software giant Intuit, which has avoided mass layoffs, says tech firms axed jobs because they misread the pandemic: \n The CEO of Intuit, which has not conducted mass cuts, said companies wrongly believed temporary pandemic growth would lead to permanent gains.", " Ask HN: Engineering managers, how do you onboard new hires?: \n Comments", " Changed Your iPhone's Passcode and Forgot It? iOS 17 Gives You 72 Hours to Reset It: \n If you change your iPhone's passcode and forget it soon after, iOS 17 has a new option available to help out. Specifically, it is now possible to reset an iPhone's new passcode with the previous passcode for up to 72 hours after the change is made.\n\n\n\n\n\nIf yo…", " NASA Safety Panel Questions Boeing Starliner’s Readiness for Crewed Demo: \n NASA’s Aerospace Safety Advisory Panel dropped a bombshell yesterday by urging the space agency to set up an independent review of Boeing’s Starliner program—a mere 57 days before NASA astronauts Sunita Williams and Barry “Butch” Wilmore are scheduled to ride…", " Generative AI: Posing Risk of Criminal Abuse: \n The use of generative artificial intelligence (AI) by hackers has become an emerging threat to cybersecurity. Generative AI allows hackers to generate realistic and convincing fake data, such as images, videos, and text, which they can use for phishing scams,…", " Merge unveils Blueprint, an AI-powered tool to enable easier API integrations: \n Today, Merge launches Blueprint, a tool that leverages OpenAI's GPT-3.5 LLM, allowing users to paste a link to the documentation of an API.", " iOS 17 Promises to Dramatically Improve iPhone's Autocorrect: \n Apple today previewed iOS 17 for the iPhone, and one of the key new features coming with the update is improved autocorrect functionality.\n\n\n\n\n\nApple says iOS 17 includes a state-of-the-art language model for word prediction that will greatly improve autocorr…", " iOS 17 Gives You 72 Hours To Undo An iPhone Passcode Change: \n In iOS 17, iPhone users who change their passcode will be able to reset it within 72 hours using the previous passcode. However, users can choose to expire the previous passcode immediately in the Settings app to increase security. MacRumors reports: If you e…", " How US Universities Hope to Build a New Semiconductor Workforce: \n There's shortages of young semiconductor engineers around the world, reports IEEE Spectrum — partially explained by this quote from Intel's director of university research collaboration. \"We hear from academics that we're losing EE students to software. But w…", " 'He's About to Graduate College and Join SpaceX as an Engineer. He's 14.': \n \"Kairan Quazi will probably need someone to drive him to work at SpaceX,\" writes the Los Angeles Times — because \"He's only 14.\"\n\nThe teen is scheduled to graduate this month from the Santa Clara University School of Engineering before starting a job as a sof…", " IntelligentPad (1989) a component-based drag-and-drop software creator: \n IntelligentPad was a drag-and-drop software creator based on the concept of reusable components. Pads could be reused on other pads. There was no programming...", " Ask HN: Tired of being a software engineer, what next?: \n Comments", " CodeTF: One-Stop Transformer Library for State-of-the-Art Code LLM: \n Code intelligence plays a key role in transforming modern software\nengineering. Recently, deep learning-based models, especially Transformer-based\nlarge language models (LLMs), have demonstrated remarkable potential in\ntackling these tasks by leveraging massi…", " Ask HN: Any software engineers here that switched to a business/sales role?: \n Comments", " What is Network Security?, Definitions, Types, Tools & Attacks: \n Network security protects computer networks from unauthorized access, misuse, modification, or destruction. It involves a range of technologies, practices, and policies designed to ensure network resources’ confidentiality, integrity, and availability. Types …", " Red Hat is Dropping Its Support for LibreOffice: \n The Red Hat Package Managers for LibreOffice \"have recently been orphaned,\" according to a post by Red Hat manager Matthias Clasen on the \"LibreOffice packages\" mailing list, \"and I thought it would be good to explain the reasons behind this.\"\nThe Red Hat Dis…", " Aviator (YC S21) is hiring senior engineers who are passionate about DX: \n About us\nOne of the largest trends that has happened in the last few decades is how people work. Although in software world remote work has been done for several years, never has the tooling been built from ground up for software engineers. We are building th…", " Contrary View: Chatbots Don’t Help Programmers: \n [Bertrand Meyer] is a decided contrarian in his views on AI and programming. In a recent Communications of the ACM blog post, he reveals that — unlike many others — he thinks AI in its …", " Senators Think TikTok's CEO Lied to Congress: \n At least three US senators think TikTok’s CEO may have violated federal law. In recent letters, the lawmakers say Shou Zi Chew lied about the company’s data storage practices during a combative Congressional hearing earlier this year. The renewed focus on Che…", " Rise: Accelerate the Development of Open Source Software for RISC-V: \n Enabling commercial-ready software for application processors using RISC-V architecture for segments including mobile, consumer electronics, datacenter, and automotive", " Is software eating Japan? (from my email): \n I came across a great series of posts by Richard Katz about Japan and information technology. It shows that software has not eaten Japan (for now?). Some interesting facts:– “by 2025, 60% of Japan’s large companies will be operating core systems that are more…", " Craig Federighi outlines iOS 17 privacy & Apple's stance on AI: \n Along with the software and hardware announcements at WWDC, Apple executive Craig Federighi emphasized the company's ongoing commitment to privacy, exemplified by features such as \"Check In,\" and why he thinks AI can be beneficial for users.Apple is introduci…", " Using Adapt and Beam for Effective Data Modeling: \n Uncover the power of data architecture patterns and tools in Part 3. Discover the future of data modeling and engineering.", " OpenAI CEO Sam Altman is privately reassuring developers using the company's tech that it won't compete with them beyond ChatGPT: \n A blog post detailing Sam Altman's meeting with developers in London reveals some of OpenAI's secrets and plans for the coming year.", " Apple demoed one of its new features by displaying a downright weird message about finding a bunch of raccoons hidden in a basement: \n Apple unveiled a \"Live Voicemail\" feature using an attention-grabbing demo of a man about to bathe a family of raccoons he discovered in a basement.", " McKinsey Report Finds Generative AI Could Add Up To $4.4 Trillion a Year To the Global Economy: \n According to global consulting leader McKinsey and Company, Generative AI could add \"2.6 trillion to $4.4 trillion annually\" to the global economy. That's almost the \"economic equivalent of adding an entire new country the size and productivity of the United …", " Ford's F-150 Lighting loses a quarter of its range when hauling at max capacity — highlighting one of the biggest drawbacks of electric trucks: \n The F-150 Lightning's range fell from 278 miles to 210 miles, a 24.5% difference, when hauling sandbags weighing 1,400 pounds, AAA said.", " Apple's new iOS 17 will warn you if someone tries to send unsolicited nudes: \n Apple said in a press release that the Sensitive Content Warning would help adult users avoid \"unwanted nude images and videos.\"", " Meticulous (YC S21) Is Hiring Founding Engineer to Build AI for UI Testing: \n Comments", " Meticulous (YC S21) is hiring founding engineer to build AI for testing: \n Comments", " Teenage Engineering OP-1: How a Micro Synth Made a Massive Impact in Music Tech: \n The unexpected journey of a portable synthesizer that captured the public imagination and launched a powerhouse design studio", " Searchable and sortable H1B salary database: \n Comments", " The Industrial Hammer Complex: \n I’ve been programming for 35 years and getting paid to do it for almost 20. I’m happy to say that I still love it just as much as when I typed those first programs into my C64 as a kid. However...", " ★ Proposed Name for GM’s Upcoming In-House Software Platform (You Know, the One That Isn’t Going to Support CarPlay): Edsel: \n GM’s $20–25 billion target for services revenue by 2030 feels like a Kendall Roy number — plucked out of thin air by someone just making up figures in an Excel spreadsheet until they get the SUM() result they’re looking for.", " Some tech workers spend only 4 hours a day on productive work: Blind poll: \n Some tech workers say they're only spending a few hours a day on productive work, according to a new poll on the anonymous job messaging site Blind.", " Laugh Along with GNU – GNU Humor: \n Comments", " I Wrote My First Software Design Doc to Win New Project: \n The story of how a Software Design Doc helped me kick off a new R&D project and allowed me to validate assumptions.", " Revamping Product Strategy: A Necessity for Manufacturers: \n Everything in our world constantly changes, from the music we enjoy and the star players on our favorite sports teams to the energy sources we rely on. Nothing in this world stays the same for very long, so the ability to adapt is an asset. It’s primarily evi…", " Petrol and diesel engines are dying technology. The electric car age is inevitable | Ben Lane: \n Arguments over the green credentials of electric cars are already over. Work on 21st-century tech, and leave the past behind<ul><li>Ben Lane is co-founder and CTO at Zapmap, a UK-wide map of electric car charging points</li></ul>It should by now be clear to a…", " Bitmovin (YC S15) Is Hiring an Engineering Manager for Encoding in Berlin: \n Core skills: Leadership, Coaching, Career Planning, Agile Software Delivery, Hiring, Project Management, Design for scalability, Cloud Native, Microservices,", " A Fight Over the Right to Repair Cars Takes a Wild Turn: \n A landmark right to repair law in Massachusetts is great for car owners. The US government argues it’s also great for hackers.", " iOS 17 beta has no sideloading, but Craig Federighi says Apple might comply with EU: \n Apple has come under scrutiny as governments around the world, especially the European Union, accuse the company of anti-competitive practices because of the App Store and iOS not allowing users to install apps from other sources. A report last year revealed …", " Is Prompt Engineering a Real Job? 9 Factors to Consider: \n Curious about the emerging field of AI prompt engineering? Here are some key factors to consider and get insights into this emerging career path.", " Striking the Right Balance: Over-Engineering vs. Under-Engineering Software: \n In the dynamic realm of software development, striking the right balance between over-engineering and under-engineering is a perpetual challenge. Both approaches present their unique advantages and disadvantages, making it essential for junior and mid-level s…", " How generative AI code assistants could revolutionize developer experience: \n Why tech leaders must evolve development teams to embrace generative AI code assistants and plan for the next-gen engineering experience.", " Software Engineering Lessons from RCAs of greatest disasters: \n Comments", " Real life indirection is the root of all evil, and AI agents can fix it: \n Blog about Software Engineering and Music Production.", " Big Tech salaries revealed: This is what developers, engineers, and product managers make at Google, Apple, Meta, and Amazon: \n Big tech salaries unveil earnings of engineers, developers, and product managers at Google, Apple, Amazon, Meta, Microsoft, Uber, and Salesforce."]}